xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/******************  Bit definition for ADC_SMPTIM2 register  *******************/
#define ADC_SMPTIM2_SMPCYCCFG0_Pos                                  (0U)
#define ADC_SMPTIM2_SMPCYCCFG0_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG0_Pos)                          /*!< 0x00000007 */
#define ADC_SMPTIM2_SMPCYCCFG0                                      ADC_SMPTIM2_SMPCYCCFG0_Msk                                     /*!<SMP0[2:0] bits (Channel 0 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG0_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG0_Pos)                          /*!< 0x00000001 */
#define ADC_SMPTIM2_SMPCYCCFG0_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG0_Pos)                          /*!< 0x00000002 */
#define ADC_SMPTIM2_SMPCYCCFG0_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG0_Pos)                          /*!< 0x00000004 */
#define ADC_SMPTIM2_SMPCYCCFG1_Pos                                  (3U)
#define ADC_SMPTIM2_SMPCYCCFG1_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG1_Pos)                          /*!< 0x00000038 */
#define ADC_SMPTIM2_SMPCYCCFG1                                      ADC_SMPTIM2_SMPCYCCFG1_Msk                                     /*!<SMP1[2:0] bits (Channel 1 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG1_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG1_Pos)                          /*!< 0x00000008 */
#define ADC_SMPTIM2_SMPCYCCFG1_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG1_Pos)                          /*!< 0x00000010 */
#define ADC_SMPTIM2_SMPCYCCFG1_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG1_Pos)                          /*!< 0x00000020 */
#define ADC_SMPTIM2_SMPCYCCFG2_Pos                                  (6U)
#define ADC_SMPTIM2_SMPCYCCFG2_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG2_Pos)                          /*!< 0x000001C0 */
#define ADC_SMPTIM2_SMPCYCCFG2                                      ADC_SMPTIM2_SMPCYCCFG2_Msk                                     /*!<SMP2[2:0] bits (Channel 2 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG2_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG2_Pos)                          /*!< 0x00000040 */
#define ADC_SMPTIM2_SMPCYCCFG2_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG2_Pos)                          /*!< 0x00000080 */
#define ADC_SMPTIM2_SMPCYCCFG2_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG2_Pos)                          /*!< 0x00000100 */
#define ADC_SMPTIM2_SMPCYCCFG3_Pos                                  (9U)
#define ADC_SMPTIM2_SMPCYCCFG3_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG3_Pos)                          /*!< 0x00000E00 */
#define ADC_SMPTIM2_SMPCYCCFG3                                      ADC_SMPTIM2_SMPCYCCFG3_Msk                                     /*!<SMP3[2:0] bits (Channel 3 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG3_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG3_Pos)                          /*!< 0x00000200 */
#define ADC_SMPTIM2_SMPCYCCFG3_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG3_Pos)                          /*!< 0x00000400 */
#define ADC_SMPTIM2_SMPCYCCFG3_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG3_Pos)                          /*!< 0x00000800 */
#define ADC_SMPTIM2_SMPCYCCFG4_Pos                                  (12U)
#define ADC_SMPTIM2_SMPCYCCFG4_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG4_Pos)                          /*!< 0x00007000 */
#define ADC_SMPTIM2_SMPCYCCFG4                                      ADC_SMPTIM2_SMPCYCCFG4_Msk                                     /*!<SMP4[2:0] bits (Channel 4 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG4_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG4_Pos)                          /*!< 0x00001000 */
#define ADC_SMPTIM2_SMPCYCCFG4_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG4_Pos)                          /*!< 0x00002000 */
#define ADC_SMPTIM2_SMPCYCCFG4_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG4_Pos)                          /*!< 0x00004000 */
#define ADC_SMPTIM2_SMPCYCCFG5_Pos                                  (15U)
#define ADC_SMPTIM2_SMPCYCCFG5_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG5_Pos)                          /*!< 0x00038000 */
#define ADC_SMPTIM2_SMPCYCCFG5                                      ADC_SMPTIM2_SMPCYCCFG5_Msk                                     /*!<SMP5[2:0] bits (Channel 5 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG5_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG5_Pos)                          /*!< 0x00008000 */
#define ADC_SMPTIM2_SMPCYCCFG5_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG5_Pos)                          /*!< 0x00010000 */
#define ADC_SMPTIM2_SMPCYCCFG5_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG5_Pos)                          /*!< 0x00020000 */
#define ADC_SMPTIM2_SMPCYCCFG6_Pos                                  (18U)
#define ADC_SMPTIM2_SMPCYCCFG6_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG6_Pos)                          /*!< 0x001C0000 */
#define ADC_SMPTIM2_SMPCYCCFG6                                      ADC_SMPTIM2_SMPCYCCFG6_Msk                                     /*!<SMP6[2:0] bits (Channel 6 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG6_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG6_Pos)                          /*!< 0x00040000 */
#define ADC_SMPTIM2_SMPCYCCFG6_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG6_Pos)                          /*!< 0x00080000 */
#define ADC_SMPTIM2_SMPCYCCFG6_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG6_Pos)                          /*!< 0x00100000 */
#define ADC_SMPTIM2_SMPCYCCFG7_Pos                                  (21U)
#define ADC_SMPTIM2_SMPCYCCFG7_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG7_Pos)                          /*!< 0x00E00000 */
#define ADC_SMPTIM2_SMPCYCCFG7                                      ADC_SMPTIM2_SMPCYCCFG7_Msk                                     /*!<SMP7[2:0] bits (Channel 7 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG7_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG7_Pos)                          /*!< 0x00200000 */
#define ADC_SMPTIM2_SMPCYCCFG7_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG7_Pos)                          /*!< 0x00400000 */
#define ADC_SMPTIM2_SMPCYCCFG7_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG7_Pos)                          /*!< 0x00800000 */
#define ADC_SMPTIM2_SMPCYCCFG8_Pos                                  (24U)
#define ADC_SMPTIM2_SMPCYCCFG8_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG8_Pos)                          /*!< 0x07000000 */
#define ADC_SMPTIM2_SMPCYCCFG8                                      ADC_SMPTIM2_SMPCYCCFG8_Msk                                     /*!<SMP8[2:0] bits (Channel 8 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG8_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG8_Pos)                          /*!< 0x01000000 */
#define ADC_SMPTIM2_SMPCYCCFG8_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG8_Pos)                          /*!< 0x02000000 */
#define ADC_SMPTIM2_SMPCYCCFG8_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG8_Pos)                          /*!< 0x04000000 */
#define ADC_SMPTIM2_SMPCYCCFG9_Pos                                  (27U)
#define ADC_SMPTIM2_SMPCYCCFG9_Msk                                  (0x7UL << ADC_SMPTIM2_SMPCYCCFG9_Pos)                          /*!< 0x38000000 */
#define ADC_SMPTIM2_SMPCYCCFG9                                      ADC_SMPTIM2_SMPCYCCFG9_Msk                                     /*!<SMP9[2:0] bits (Channel 9 Sample time selection) */
#define ADC_SMPTIM2_SMPCYCCFG9_0                                    (0x1UL << ADC_SMPTIM2_SMPCYCCFG9_Pos)                          /*!< 0x08000000 */
#define ADC_SMPTIM2_SMPCYCCFG9_1                                    (0x2UL << ADC_SMPTIM2_SMPCYCCFG9_Pos)                          /*!< 0x10000000 */
#define ADC_SMPTIM2_SMPCYCCFG9_2                                    (0x4UL << ADC_SMPTIM2_SMPCYCCFG9_Pos)                          /*!< 0x20000000 */

/******************  Bit definition for ADC_INJDOF1 register  *******************/
#define ADC_INJDOF1_INJDOF1_Pos                                     (0U)
#define ADC_INJDOF1_INJDOF1_Msk                                     (0xFFFUL << ADC_INJDOF1_INJDOF1_Pos)                           /*!< 0x00000FFF */
#define ADC_INJDOF1_INJDOF1                                         ADC_INJDOF1_INJDOF1_Msk                                        /*!<Data offset for injected channel 1 */

