xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define CAN_TXSTS_LOWESTP_Pos                                       (29U)
#define CAN_TXSTS_LOWESTP_Msk                                       (0x7UL << CAN_TXSTS_LOWESTP_Pos)                               /*!< 0xE0000000 */
#define CAN_TXSTS_LOWESTP                                           CAN_TXSTS_LOWESTP_Msk                                          /*!<LOW[2:0] bits */
#define CAN_TXSTS_LOWESTP0_Pos                                      (29U)
#define CAN_TXSTS_LOWESTP0_Msk                                      (0x1UL << CAN_TXSTS_LOWESTP0_Pos)                              /*!< 0x20000000 */
#define CAN_TXSTS_LOWESTP0                                          CAN_TXSTS_LOWESTP0_Msk                                         /*!<Lowest Priority Flag for Mailbox 0 */
#define CAN_TXSTS_LOWESTP1_Pos                                      (30U)
#define CAN_TXSTS_LOWESTP1_Msk                                      (0x1UL << CAN_TXSTS_LOWESTP1_Pos)                              /*!< 0x40000000 */
#define CAN_TXSTS_LOWESTP1                                          CAN_TXSTS_LOWESTP1_Msk                                         /*!<Lowest Priority Flag for Mailbox 1 */
#define CAN_TXSTS_LOWESTP2_Pos                                      (31U)
#define CAN_TXSTS_LOWESTP2_Msk                                      (0x1UL << CAN_TXSTS_LOWESTP2_Pos)                              /*!< 0x80000000 */
#define CAN_TXSTS_LOWESTP2                                          CAN_TXSTS_LOWESTP2_Msk                                         /*!<Lowest Priority Flag for Mailbox 2 */

/*******************  Bit definition for CAN_RXF0 register  *******************/
#define CAN_RXF0_FMNUM0_Pos                                         (0U)
#define CAN_RXF0_FMNUM0_Msk                                         (0x3UL << CAN_RXF0_FMNUM0_Pos)                                 /*!< 0x00000003 */
#define CAN_RXF0_FMNUM0                                             CAN_RXF0_FMNUM0_Msk                                            /*!<FIFO 0 Message Pending */
#define CAN_RXF0_FFULLFLG0_Pos                                      (3U)
#define CAN_RXF0_FFULLFLG0_Msk                                      (0x1UL << CAN_RXF0_FFULLFLG0_Pos)                              /*!< 0x00000008 */
#define CAN_RXF0_FFULLFLG0                                          CAN_RXF0_FFULLFLG0_Msk                                         /*!<FIFO 0 Full */
#define CAN_RXF0_FOVRFLG0_Pos                                       (4U)
#define CAN_RXF0_FOVRFLG0_Msk                                       (0x1UL << CAN_RXF0_FOVRFLG0_Pos)                               /*!< 0x00000010 */
#define CAN_RXF0_FOVRFLG0                                           CAN_RXF0_FOVRFLG0_Msk                                          /*!<FIFO 0 Overrun */
#define CAN_RXF0_RFOM0_Pos                                          (5U)
#define CAN_RXF0_RFOM0_Msk                                          (0x1UL << CAN_RXF0_RFOM0_Pos)                                  /*!< 0x00000020 */
#define CAN_RXF0_RFOM0                                              CAN_RXF0_RFOM0_Msk                                             /*!<Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RXF1 register  *******************/
#define CAN_RXF1_FMNUM1_Pos                                         (0U)
#define CAN_RXF1_FMNUM1_Msk                                         (0x3UL << CAN_RXF1_FMNUM1_Pos)                                 /*!< 0x00000003 */
#define CAN_RXF1_FMNUM1                                             CAN_RXF1_FMNUM1_Msk                                            /*!<FIFO 1 Message Pending */
#define CAN_RXF1_FFULLFLG1_Pos                                      (3U)
#define CAN_RXF1_FFULLFLG1_Msk                                      (0x1UL << CAN_RXF1_FFULLFLG1_Pos)                              /*!< 0x00000008 */
#define CAN_RXF1_FFULLFLG1                                          CAN_RXF1_FFULLFLG1_Msk                                         /*!<FIFO 1 Full */
#define CAN_RXF1_FOVRFLG1_Pos                                       (4U)
#define CAN_RXF1_FOVRFLG1_Msk                                       (0x1UL << CAN_RXF1_FOVRFLG1_Pos)                               /*!< 0x00000010 */
#define CAN_RXF1_FOVRFLG1                                           CAN_RXF1_FOVRFLG1_Msk                                          /*!<FIFO 1 Overrun */
#define CAN_RXF1_RFOM1_Pos                                          (5U)
#define CAN_RXF1_RFOM1_Msk                                          (0x1UL << CAN_RXF1_RFOM1_Pos)                                  /*!< 0x00000020 */
#define CAN_RXF1_RFOM1                                              CAN_RXF1_RFOM1_Msk                                             /*!<Release FIFO 1 Output Mailbox */

/********************  Bit definition for CAN_INTEN register  *******************/
#define CAN_INTEN_TXMEIEN_Pos                                       (0U)
#define CAN_INTEN_TXMEIEN_Msk                                       (0x1UL << CAN_INTEN_TXMEIEN_Pos)                               /*!< 0x00000001 */
#define CAN_INTEN_TXMEIEN                                           CAN_INTEN_TXMEIEN_Msk                                          /*!<Transmit Mailbox Empty Interrupt Enable */
#define CAN_INTEN_FMIEN0_Pos                                        (1U)
#define CAN_INTEN_FMIEN0_Msk                                        (0x1UL << CAN_INTEN_FMIEN0_Pos)                                /*!< 0x00000002 */
#define CAN_INTEN_FMIEN0                                            CAN_INTEN_FMIEN0_Msk                                           /*!<FIFO Message Pending Interrupt Enable */
#define CAN_INTEN_FFULLIEN0_Pos                                     (2U)
#define CAN_INTEN_FFULLIEN0_Msk                                     (0x1UL << CAN_INTEN_FFULLIEN0_Pos)                             /*!< 0x00000004 */
#define CAN_INTEN_FFULLIEN0                                         CAN_INTEN_FFULLIEN0_Msk                                        /*!<FIFO Full Interrupt Enable */
#define CAN_INTEN_FOVRIEN0_Pos                                      (3U)
#define CAN_INTEN_FOVRIEN0_Msk                                      (0x1UL << CAN_INTEN_FOVRIEN0_Pos)                              /*!< 0x00000008 */
#define CAN_INTEN_FOVRIEN0                                          CAN_INTEN_FOVRIEN0_Msk                                         /*!<FIFO Overrun Interrupt Enable */
#define CAN_INTEN_FMIEN1_Pos                                        (4U)
#define CAN_INTEN_FMIEN1_Msk                                        (0x1UL << CAN_INTEN_FMIEN1_Pos)                                /*!< 0x00000010 */
#define CAN_INTEN_FMIEN1                                            CAN_INTEN_FMIEN1_Msk                                           /*!<FIFO Message Pending Interrupt Enable */
#define CAN_INTEN_FFULLIEN1_Pos                                     (5U)
#define CAN_INTEN_FFULLIEN1_Msk                                     (0x1UL << CAN_INTEN_FFULLIEN1_Pos)                             /*!< 0x00000020 */
#define CAN_INTEN_FFULLIEN1                                         CAN_INTEN_FFULLIEN1_Msk                                        /*!<FIFO Full Interrupt Enable */
#define CAN_INTEN_FOVRIEN1_Pos                                      (6U)
#define CAN_INTEN_FOVRIEN1_Msk                                      (0x1UL << CAN_INTEN_FOVRIEN1_Pos)                              /*!< 0x00000040 */
#define CAN_INTEN_FOVRIEN1                                          CAN_INTEN_FOVRIEN1_Msk                                         /*!<FIFO Overrun Interrupt Enable */
#define CAN_INTEN_ERRWIEN_Pos                                       (8U)
#define CAN_INTEN_ERRWIEN_Msk                                       (0x1UL << CAN_INTEN_ERRWIEN_Pos)                               /*!< 0x00000100 */
#define CAN_INTEN_ERRWIEN                                           CAN_INTEN_ERRWIEN_Msk                                          /*!<Error Warning Interrupt Enable */
#define CAN_INTEN_ERRPIEN_Pos                                       (9U)
#define CAN_INTEN_ERRPIEN_Msk                                       (0x1UL << CAN_INTEN_ERRPIEN_Pos)                               /*!< 0x00000200 */
#define CAN_INTEN_ERRPIEN                                           CAN_INTEN_ERRPIEN_Msk                                          /*!<Error Passive Interrupt Enable */
#define CAN_INTEN_BOFFIEN_Pos                                       (10U)
#define CAN_INTEN_BOFFIEN_Msk                                       (0x1UL << CAN_INTEN_BOFFIEN_Pos)                               /*!< 0x00000400 */
#define CAN_INTEN_BOFFIEN                                           CAN_INTEN_BOFFIEN_Msk                                          /*!<Bus-Off Interrupt Enable */
#define CAN_INTEN_LECIEN_Pos                                        (11U)
#define CAN_INTEN_LECIEN_Msk                                        (0x1UL << CAN_INTEN_LECIEN_Pos)                                /*!< 0x00000800 */
#define CAN_INTEN_LECIEN                                            CAN_INTEN_LECIEN_Msk                                           /*!<Last Error Code Interrupt Enable */
#define CAN_INTEN_ERRIEN_Pos                                        (15U)
#define CAN_INTEN_ERRIEN_Msk                                        (0x1UL << CAN_INTEN_ERRIEN_Pos)                                /*!< 0x00008000 */
#define CAN_INTEN_ERRIEN                                            CAN_INTEN_ERRIEN_Msk                                           /*!<Error Interrupt Enable */
#define CAN_INTEN_WUPIEN_Pos                                        (16U)
#define CAN_INTEN_WUPIEN_Msk                                        (0x1UL << CAN_INTEN_WUPIEN_Pos)                                /*!< 0x00010000 */
#define CAN_INTEN_WUPIEN                                            CAN_INTEN_WUPIEN_Msk                                           /*!<Wakeup Interrupt Enable */
#define CAN_INTEN_SLEEPIEN_Pos                                      (17U)
#define CAN_INTEN_SLEEPIEN_Msk                                      (0x1UL << CAN_INTEN_SLEEPIEN_Pos)                              /*!< 0x00020000 */
#define CAN_INTEN_SLEEPIEN                                          CAN_INTEN_SLEEPIEN_Msk                                         /*!<Sleep Interrupt Enable */

/********************  Bit definition for CAN_ERRSTS register  *******************/
#define CAN_ERRSTS_ERRWFLG_Pos                                      (0U)
#define CAN_ERRSTS_ERRWFLG_Msk                                      (0x1UL << CAN_ERRSTS_ERRWFLG_Pos)                              /*!< 0x00000001 */
#define CAN_ERRSTS_ERRWFLG                                          CAN_ERRSTS_ERRWFLG_Msk                                         /*!<Error Warning Flag */
#define CAN_ERRSTS_ERRPFLG_Pos                                      (1U)
#define CAN_ERRSTS_ERRPFLG_Msk                                      (0x1UL << CAN_ERRSTS_ERRPFLG_Pos)                              /*!< 0x00000002 */
#define CAN_ERRSTS_ERRPFLG                                          CAN_ERRSTS_ERRPFLG_Msk                                         /*!<Error Passive Flag */
#define CAN_ERRSTS_BOFLG_Pos                                        (2U)
#define CAN_ERRSTS_BOFLG_Msk                                        (0x1UL << CAN_ERRSTS_BOFLG_Pos)                                /*!< 0x00000004 */
#define CAN_ERRSTS_BOFLG                                            CAN_ERRSTS_BOFLG_Msk                                           /*!<Bus-Off Flag */

