xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bit definition for CAN_FSCFG register  *******************/
#define CAN_FSCFG_FSCFG_Pos                                         (0U)
#define CAN_FSCFG_FSCFG_Msk                                         (0xFFFFFFFUL << CAN_FSCFG_FSCFG_Pos)                           /*!< 0x0FFFFFFF */
#define CAN_FSCFG_FSCFG                                             CAN_FSCFG_FSCFG_Msk                                            /*!<Filter Scale Configuration */
#define CAN_FSCFG_FSCFG0_Pos                                        (0U)
#define CAN_FSCFG_FSCFG0_Msk                                        (0x1UL << CAN_FSCFG_FSCFG0_Pos)                                /*!< 0x00000001 */
#define CAN_FSCFG_FSCFG0                                            CAN_FSCFG_FSCFG0_Msk                                           /*!<Filter Scale Configuration bit 0 */
#define CAN_FSCFG_FSCFG1_Pos                                        (1U)
#define CAN_FSCFG_FSCFG1_Msk                                        (0x1UL << CAN_FSCFG_FSCFG1_Pos)                                /*!< 0x00000002 */
#define CAN_FSCFG_FSCFG1                                            CAN_FSCFG_FSCFG1_Msk                                           /*!<Filter Scale Configuration bit 1 */
#define CAN_FSCFG_FSCFG2_Pos                                        (2U)
#define CAN_FSCFG_FSCFG2_Msk                                        (0x1UL << CAN_FSCFG_FSCFG2_Pos)                                /*!< 0x00000004 */
#define CAN_FSCFG_FSCFG2                                            CAN_FSCFG_FSCFG2_Msk                                           /*!<Filter Scale Configuration bit 2 */
#define CAN_FSCFG_FSCFG3_Pos                                        (3U)
#define CAN_FSCFG_FSCFG3_Msk                                        (0x1UL << CAN_FSCFG_FSCFG3_Pos)                                /*!< 0x00000008 */
#define CAN_FSCFG_FSCFG3                                            CAN_FSCFG_FSCFG3_Msk                                           /*!<Filter Scale Configuration bit 3 */
#define CAN_FSCFG_FSCFG4_Pos                                        (4U)
#define CAN_FSCFG_FSCFG4_Msk                                        (0x1UL << CAN_FSCFG_FSCFG4_Pos)                                /*!< 0x00000010 */
#define CAN_FSCFG_FSCFG4                                            CAN_FSCFG_FSCFG4_Msk                                           /*!<Filter Scale Configuration bit 4 */
#define CAN_FSCFG_FSCFG5_Pos                                        (5U)
#define CAN_FSCFG_FSCFG5_Msk                                        (0x1UL << CAN_FSCFG_FSCFG5_Pos)                                /*!< 0x00000020 */
#define CAN_FSCFG_FSCFG5                                            CAN_FSCFG_FSCFG5_Msk                                           /*!<Filter Scale Configuration bit 5 */
#define CAN_FSCFG_FSCFG6_Pos                                        (6U)
#define CAN_FSCFG_FSCFG6_Msk                                        (0x1UL << CAN_FSCFG_FSCFG6_Pos)                                /*!< 0x00000040 */
#define CAN_FSCFG_FSCFG6                                            CAN_FSCFG_FSCFG6_Msk                                           /*!<Filter Scale Configuration bit 6 */
#define CAN_FSCFG_FSCFG7_Pos                                        (7U)
#define CAN_FSCFG_FSCFG7_Msk                                        (0x1UL << CAN_FSCFG_FSCFG7_Pos)                                /*!< 0x00000080 */
#define CAN_FSCFG_FSCFG7                                            CAN_FSCFG_FSCFG7_Msk                                           /*!<Filter Scale Configuration bit 7 */
#define CAN_FSCFG_FSCFG8_Pos                                        (8U)
#define CAN_FSCFG_FSCFG8_Msk                                        (0x1UL << CAN_FSCFG_FSCFG8_Pos)                                /*!< 0x00000100 */
#define CAN_FSCFG_FSCFG8                                            CAN_FSCFG_FSCFG8_Msk                                           /*!<Filter Scale Configuration bit 8 */
#define CAN_FSCFG_FSCFG9_Pos                                        (9U)
#define CAN_FSCFG_FSCFG9_Msk                                        (0x1UL << CAN_FSCFG_FSCFG9_Pos)                                /*!< 0x00000200 */
#define CAN_FSCFG_FSCFG9                                            CAN_FSCFG_FSCFG9_Msk                                           /*!<Filter Scale Configuration bit 9 */
#define CAN_FSCFG_FSCFG10_Pos                                       (10U)
#define CAN_FSCFG_FSCFG10_Msk                                       (0x1UL << CAN_FSCFG_FSCFG10_Pos)                               /*!< 0x00000400 */
#define CAN_FSCFG_FSCFG10                                           CAN_FSCFG_FSCFG10_Msk                                          /*!<Filter Scale Configuration bit 10 */
#define CAN_FSCFG_FSCFG11_Pos                                       (11U)
#define CAN_FSCFG_FSCFG11_Msk                                       (0x1UL << CAN_FSCFG_FSCFG11_Pos)                               /*!< 0x00000800 */
#define CAN_FSCFG_FSCFG11                                           CAN_FSCFG_FSCFG11_Msk                                          /*!<Filter Scale Configuration bit 11 */
#define CAN_FSCFG_FSCFG12_Pos                                       (12U)
#define CAN_FSCFG_FSCFG12_Msk                                       (0x1UL << CAN_FSCFG_FSCFG12_Pos)                               /*!< 0x00001000 */
#define CAN_FSCFG_FSCFG12                                           CAN_FSCFG_FSCFG12_Msk                                          /*!<Filter Scale Configuration bit 12 */
#define CAN_FSCFG_FSCFG13_Pos                                       (13U)
#define CAN_FSCFG_FSCFG13_Msk                                       (0x1UL << CAN_FSCFG_FSCFG13_Pos)                               /*!< 0x00002000 */
#define CAN_FSCFG_FSCFG13                                           CAN_FSCFG_FSCFG13_Msk                                          /*!<Filter Scale Configuration bit 13 */
#define CAN_FSCFG_FSCFG14_Pos                                       (14U)
#define CAN_FSCFG_FSCFG14_Msk                                       (0x1UL << CAN_FSCFG_FSCFG14_Pos)                               /*!< 0x00004000 */
#define CAN_FSCFG_FSCFG14                                           CAN_FSCFG_FSCFG14_Msk                                          /*!<Filter Scale Configuration bit 14 */
#define CAN_FSCFG_FSCFG15_Pos                                       (15U)
#define CAN_FSCFG_FSCFG15_Msk                                       (0x1UL << CAN_FSCFG_FSCFG15_Pos)                               /*!< 0x00008000 */
#define CAN_FSCFG_FSCFG15                                           CAN_FSCFG_FSCFG15_Msk                                          /*!<Filter Scale Configuration bit 15 */
#define CAN_FSCFG_FSCFG16_Pos                                       (16U)
#define CAN_FSCFG_FSCFG16_Msk                                       (0x1UL << CAN_FSCFG_FSCFG16_Pos)                               /*!< 0x00010000 */
#define CAN_FSCFG_FSCFG16                                           CAN_FSCFG_FSCFG16_Msk                                          /*!<Filter Scale Configuration bit 16 */
#define CAN_FSCFG_FSCFG17_Pos                                       (17U)
#define CAN_FSCFG_FSCFG17_Msk                                       (0x1UL << CAN_FSCFG_FSCFG17_Pos)                               /*!< 0x00020000 */
#define CAN_FSCFG_FSCFG17                                           CAN_FSCFG_FSCFG17_Msk                                          /*!<Filter Scale Configuration bit 17 */
#define CAN_FSCFG_FSCFG18_Pos                                       (18U)
#define CAN_FSCFG_FSCFG18_Msk                                       (0x1UL << CAN_FSCFG_FSCFG18_Pos)                               /*!< 0x00040000 */
#define CAN_FSCFG_FSCFG18                                           CAN_FSCFG_FSCFG18_Msk                                          /*!<Filter Scale Configuration bit 18 */
#define CAN_FSCFG_FSCFG19_Pos                                       (19U)
#define CAN_FSCFG_FSCFG19_Msk                                       (0x1UL << CAN_FSCFG_FSCFG19_Pos)                               /*!< 0x00080000 */
#define CAN_FSCFG_FSCFG19                                           CAN_FSCFG_FSCFG19_Msk                                          /*!<Filter Scale Configuration bit 19 */
#define CAN_FSCFG_FSCFG20_Pos                                       (20U)
#define CAN_FSCFG_FSCFG20_Msk                                       (0x1UL << CAN_FSCFG_FSCFG20_Pos)                               /*!< 0x00100000 */
#define CAN_FSCFG_FSCFG20                                           CAN_FSCFG_FSCFG20_Msk                                          /*!<Filter Scale Configuration bit 20 */
#define CAN_FSCFG_FSCFG21_Pos                                       (21U)
#define CAN_FSCFG_FSCFG21_Msk                                       (0x1UL << CAN_FSCFG_FSCFG21_Pos)                               /*!< 0x00200000 */
#define CAN_FSCFG_FSCFG21                                           CAN_FSCFG_FSCFG21_Msk                                          /*!<Filter Scale Configuration bit 21 */
#define CAN_FSCFG_FSCFG22_Pos                                       (22U)
#define CAN_FSCFG_FSCFG22_Msk                                       (0x1UL << CAN_FSCFG_FSCFG22_Pos)                               /*!< 0x00400000 */
#define CAN_FSCFG_FSCFG22                                           CAN_FSCFG_FSCFG22_Msk                                          /*!<Filter Scale Configuration bit 22 */
#define CAN_FSCFG_FSCFG23_Pos                                       (23U)
#define CAN_FSCFG_FSCFG23_Msk                                       (0x1UL << CAN_FSCFG_FSCFG23_Pos)                               /*!< 0x00800000 */
#define CAN_FSCFG_FSCFG23                                           CAN_FSCFG_FSCFG23_Msk                                          /*!<Filter Scale Configuration bit 23 */
#define CAN_FSCFG_FSCFG24_Pos                                       (24U)
#define CAN_FSCFG_FSCFG24_Msk                                       (0x1UL << CAN_FSCFG_FSCFG24_Pos)                               /*!< 0x01000000 */
#define CAN_FSCFG_FSCFG24                                           CAN_FSCFG_FSCFG24_Msk                                          /*!<Filter Scale Configuration bit 24 */
#define CAN_FSCFG_FSCFG25_Pos                                       (25U)
#define CAN_FSCFG_FSCFG25_Msk                                       (0x1UL << CAN_FSCFG_FSCFG25_Pos)                               /*!< 0x02000000 */
#define CAN_FSCFG_FSCFG25                                           CAN_FSCFG_FSCFG25_Msk                                          /*!<Filter Scale Configuration bit 25 */
#define CAN_FSCFG_FSCFG26_Pos                                       (26U)
#define CAN_FSCFG_FSCFG26_Msk                                       (0x1UL << CAN_FSCFG_FSCFG26_Pos)                               /*!< 0x04000000 */
#define CAN_FSCFG_FSCFG26                                           CAN_FSCFG_FSCFG26_Msk                                          /*!<Filter Scale Configuration bit 26 */
#define CAN_FSCFG_FSCFG27_Pos                                       (27U)
#define CAN_FSCFG_FSCFG27_Msk                                       (0x1UL << CAN_FSCFG_FSCFG27_Pos)                               /*!< 0x08000000 */
#define CAN_FSCFG_FSCFG27                                           CAN_FSCFG_FSCFG27_Msk                                          /*!<Filter Scale Configuration bit 27 */

