xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/********************  Bit definition for CRC_CTRL register  ********************/
#define CRC_CTRL_RST_Pos                                            (0U)
#define CRC_CTRL_RST_Msk                                            (0x1UL << CRC_CTRL_RST_Pos)                                    /*!< 0x00000001 */
#define CRC_CTRL_RST                                                CRC_CTRL_RST_Msk                                               /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_INTSTS register  *****************/
#define DMA_INTSTS_GINTFLG1_Pos                                     (0U)
#define DMA_INTSTS_GINTFLG1_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG1_Pos)                             /*!< 0x00000001 */
#define DMA_INTSTS_GINTFLG1                                         DMA_INTSTS_GINTFLG1_Msk                                        /*!< Channel 1 Global interrupt flag */
#define DMA_INTSTS_TCFLG1_Pos                                       (1U)
#define DMA_INTSTS_TCFLG1_Msk                                       (0x1UL << DMA_INTSTS_TCFLG1_Pos)                               /*!< 0x00000002 */
#define DMA_INTSTS_TCFLG1                                           DMA_INTSTS_TCFLG1_Msk                                          /*!< Channel 1 Transfer complete flag */
#define DMA_INTSTS_HTFLG1_Pos                                       (2U)
#define DMA_INTSTS_HTFLG1_Msk                                       (0x1UL << DMA_INTSTS_HTFLG1_Pos)                               /*!< 0x00000004 */
#define DMA_INTSTS_HTFLG1                                           DMA_INTSTS_HTFLG1_Msk                                          /*!< Channel 1 Half transfer flag */
#define DMA_INTSTS_TERRFLG1_Pos                                     (3U)
#define DMA_INTSTS_TERRFLG1_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG1_Pos)                             /*!< 0x00000008 */
#define DMA_INTSTS_TERRFLG1                                         DMA_INTSTS_TERRFLG1_Msk                                        /*!< Channel 1 Transfer error flag */
#define DMA_INTSTS_GINTFLG2_Pos                                     (4U)
#define DMA_INTSTS_GINTFLG2_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG2_Pos)                             /*!< 0x00000010 */
#define DMA_INTSTS_GINTFLG2                                         DMA_INTSTS_GINTFLG2_Msk                                        /*!< Channel 2 Global interrupt flag */
#define DMA_INTSTS_TCFLG2_Pos                                       (5U)
#define DMA_INTSTS_TCFLG2_Msk                                       (0x1UL << DMA_INTSTS_TCFLG2_Pos)                               /*!< 0x00000020 */
#define DMA_INTSTS_TCFLG2                                           DMA_INTSTS_TCFLG2_Msk                                          /*!< Channel 2 Transfer complete flag */
#define DMA_INTSTS_HTFLG2_Pos                                       (6U)
#define DMA_INTSTS_HTFLG2_Msk                                       (0x1UL << DMA_INTSTS_HTFLG2_Pos)                               /*!< 0x00000040 */
#define DMA_INTSTS_HTFLG2                                           DMA_INTSTS_HTFLG2_Msk                                          /*!< Channel 2 Half transfer flag */
#define DMA_INTSTS_TERRFLG2_Pos                                     (7U)
#define DMA_INTSTS_TERRFLG2_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG2_Pos)                             /*!< 0x00000080 */
#define DMA_INTSTS_TERRFLG2                                         DMA_INTSTS_TERRFLG2_Msk                                        /*!< Channel 2 Transfer error flag */
#define DMA_INTSTS_GINTFLG3_Pos                                     (8U)
#define DMA_INTSTS_GINTFLG3_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG3_Pos)                             /*!< 0x00000100 */
#define DMA_INTSTS_GINTFLG3                                         DMA_INTSTS_GINTFLG3_Msk                                        /*!< Channel 3 Global interrupt flag */
#define DMA_INTSTS_TCFLG3_Pos                                       (9U)
#define DMA_INTSTS_TCFLG3_Msk                                       (0x1UL << DMA_INTSTS_TCFLG3_Pos)                               /*!< 0x00000200 */
#define DMA_INTSTS_TCFLG3                                           DMA_INTSTS_TCFLG3_Msk                                          /*!< Channel 3 Transfer complete flag */
#define DMA_INTSTS_HTFLG3_Pos                                       (10U)
#define DMA_INTSTS_HTFLG3_Msk                                       (0x1UL << DMA_INTSTS_HTFLG3_Pos)                               /*!< 0x00000400 */
#define DMA_INTSTS_HTFLG3                                           DMA_INTSTS_HTFLG3_Msk                                          /*!< Channel 3 Half transfer flag */
#define DMA_INTSTS_TERRFLG3_Pos                                     (11U)
#define DMA_INTSTS_TERRFLG3_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG3_Pos)                             /*!< 0x00000800 */
#define DMA_INTSTS_TERRFLG3                                         DMA_INTSTS_TERRFLG3_Msk                                        /*!< Channel 3 Transfer error flag */
#define DMA_INTSTS_GINTFLG4_Pos                                     (12U)
#define DMA_INTSTS_GINTFLG4_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG4_Pos)                             /*!< 0x00001000 */
#define DMA_INTSTS_GINTFLG4                                         DMA_INTSTS_GINTFLG4_Msk                                        /*!< Channel 4 Global interrupt flag */
#define DMA_INTSTS_TCFLG4_Pos                                       (13U)
#define DMA_INTSTS_TCFLG4_Msk                                       (0x1UL << DMA_INTSTS_TCFLG4_Pos)                               /*!< 0x00002000 */
#define DMA_INTSTS_TCFLG4                                           DMA_INTSTS_TCFLG4_Msk                                          /*!< Channel 4 Transfer complete flag */
#define DMA_INTSTS_HTFLG4_Pos                                       (14U)
#define DMA_INTSTS_HTFLG4_Msk                                       (0x1UL << DMA_INTSTS_HTFLG4_Pos)                               /*!< 0x00004000 */
#define DMA_INTSTS_HTFLG4                                           DMA_INTSTS_HTFLG4_Msk                                          /*!< Channel 4 Half transfer flag */
#define DMA_INTSTS_TERRFLG4_Pos                                     (15U)
#define DMA_INTSTS_TERRFLG4_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG4_Pos)                             /*!< 0x00008000 */
#define DMA_INTSTS_TERRFLG4                                         DMA_INTSTS_TERRFLG4_Msk                                        /*!< Channel 4 Transfer error flag */
#define DMA_INTSTS_GINTFLG5_Pos                                     (16U)
#define DMA_INTSTS_GINTFLG5_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG5_Pos)                             /*!< 0x00010000 */
#define DMA_INTSTS_GINTFLG5                                         DMA_INTSTS_GINTFLG5_Msk                                        /*!< Channel 5 Global interrupt flag */
#define DMA_INTSTS_TCFLG5_Pos                                       (17U)
#define DMA_INTSTS_TCFLG5_Msk                                       (0x1UL << DMA_INTSTS_TCFLG5_Pos)                               /*!< 0x00020000 */
#define DMA_INTSTS_TCFLG5                                           DMA_INTSTS_TCFLG5_Msk                                          /*!< Channel 5 Transfer complete flag */
#define DMA_INTSTS_HTFLG5_Pos                                       (18U)
#define DMA_INTSTS_HTFLG5_Msk                                       (0x1UL << DMA_INTSTS_HTFLG5_Pos)                               /*!< 0x00040000 */
#define DMA_INTSTS_HTFLG5                                           DMA_INTSTS_HTFLG5_Msk                                          /*!< Channel 5 Half transfer flag */
#define DMA_INTSTS_TERRFLG5_Pos                                     (19U)
#define DMA_INTSTS_TERRFLG5_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG5_Pos)                             /*!< 0x00080000 */
#define DMA_INTSTS_TERRFLG5                                         DMA_INTSTS_TERRFLG5_Msk                                        /*!< Channel 5 Transfer error flag */
#define DMA_INTSTS_GINTFLG6_Pos                                     (20U)
#define DMA_INTSTS_GINTFLG6_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG6_Pos)                             /*!< 0x00100000 */
#define DMA_INTSTS_GINTFLG6                                         DMA_INTSTS_GINTFLG6_Msk                                        /*!< Channel 6 Global interrupt flag */
#define DMA_INTSTS_TCFLG6_Pos                                       (21U)
#define DMA_INTSTS_TCFLG6_Msk                                       (0x1UL << DMA_INTSTS_TCFLG6_Pos)                               /*!< 0x00200000 */
#define DMA_INTSTS_TCFLG6                                           DMA_INTSTS_TCFLG6_Msk                                          /*!< Channel 6 Transfer complete flag */
#define DMA_INTSTS_HTFLG6_Pos                                       (22U)
#define DMA_INTSTS_HTFLG6_Msk                                       (0x1UL << DMA_INTSTS_HTFLG6_Pos)                               /*!< 0x00400000 */
#define DMA_INTSTS_HTFLG6                                           DMA_INTSTS_HTFLG6_Msk                                          /*!< Channel 6 Half transfer flag */
#define DMA_INTSTS_TERRFLG6_Pos                                     (23U)
#define DMA_INTSTS_TERRFLG6_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG6_Pos)                             /*!< 0x00800000 */
#define DMA_INTSTS_TERRFLG6                                         DMA_INTSTS_TERRFLG6_Msk                                        /*!< Channel 6 Transfer error flag */
#define DMA_INTSTS_GINTFLG7_Pos                                     (24U)
#define DMA_INTSTS_GINTFLG7_Msk                                     (0x1UL << DMA_INTSTS_GINTFLG7_Pos)                             /*!< 0x01000000 */
#define DMA_INTSTS_GINTFLG7                                         DMA_INTSTS_GINTFLG7_Msk                                        /*!< Channel 7 Global interrupt flag */
#define DMA_INTSTS_TCFLG7_Pos                                       (25U)
#define DMA_INTSTS_TCFLG7_Msk                                       (0x1UL << DMA_INTSTS_TCFLG7_Pos)                               /*!< 0x02000000 */
#define DMA_INTSTS_TCFLG7                                           DMA_INTSTS_TCFLG7_Msk                                          /*!< Channel 7 Transfer complete flag */
#define DMA_INTSTS_HTFLG7_Pos                                       (26U)
#define DMA_INTSTS_HTFLG7_Msk                                       (0x1UL << DMA_INTSTS_HTFLG7_Pos)                               /*!< 0x04000000 */
#define DMA_INTSTS_HTFLG7                                           DMA_INTSTS_HTFLG7_Msk                                          /*!< Channel 7 Half transfer flag */
#define DMA_INTSTS_TERRFLG7_Pos                                     (27U)
#define DMA_INTSTS_TERRFLG7_Msk                                     (0x1UL << DMA_INTSTS_TERRFLG7_Pos)                             /*!< 0x08000000 */
#define DMA_INTSTS_TERRFLG7                                         DMA_INTSTS_TERRFLG7_Msk                                        /*!< Channel 7 Transfer error flag */

/*******************  Bits definition for DMA_INTFCLR register  *****************/
#define DMA_INTFCLR_GINTCLR1_Pos                                    (0U)
#define DMA_INTFCLR_GINTCLR1_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR1_Pos)                            /*!< 0x00000001 */
#define DMA_INTFCLR_GINTCLR1                                        DMA_INTFCLR_GINTCLR1_Msk                                       /*!< Channel 1 Global interrupt clear */
#define DMA_INTFCLR_TCCLR1_Pos                                      (1U)
#define DMA_INTFCLR_TCCLR1_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR1_Pos)                              /*!< 0x00000002 */
#define DMA_INTFCLR_TCCLR1                                          DMA_INTFCLR_TCCLR1_Msk                                         /*!< Channel 1 Transfer complete clear */
#define DMA_INTFCLR_HTCLR1_Pos                                      (2U)
#define DMA_INTFCLR_HTCLR1_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR1_Pos)                              /*!< 0x00000004 */
#define DMA_INTFCLR_HTCLR1                                          DMA_INTFCLR_HTCLR1_Msk                                         /*!< Channel 1 Half transfer clear */
#define DMA_INTFCLR_TERRCLR1_Pos                                    (3U)
#define DMA_INTFCLR_TERRCLR1_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR1_Pos)                            /*!< 0x00000008 */
#define DMA_INTFCLR_TERRCLR1                                        DMA_INTFCLR_TERRCLR1_Msk                                       /*!< Channel 1 Transfer error clear */
#define DMA_INTFCLR_GINTCLR2_Pos                                    (4U)
#define DMA_INTFCLR_GINTCLR2_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR2_Pos)                            /*!< 0x00000010 */
#define DMA_INTFCLR_GINTCLR2                                        DMA_INTFCLR_GINTCLR2_Msk                                       /*!< Channel 2 Global interrupt clear */
#define DMA_INTFCLR_TCCLR2_Pos                                      (5U)
#define DMA_INTFCLR_TCCLR2_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR2_Pos)                              /*!< 0x00000020 */
#define DMA_INTFCLR_TCCLR2                                          DMA_INTFCLR_TCCLR2_Msk                                         /*!< Channel 2 Transfer complete clear */
#define DMA_INTFCLR_HTCLR2_Pos                                      (6U)
#define DMA_INTFCLR_HTCLR2_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR2_Pos)                              /*!< 0x00000040 */
#define DMA_INTFCLR_HTCLR2                                          DMA_INTFCLR_HTCLR2_Msk                                         /*!< Channel 2 Half transfer clear */
#define DMA_INTFCLR_TERRCLR2_Pos                                    (7U)
#define DMA_INTFCLR_TERRCLR2_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR2_Pos)                            /*!< 0x00000080 */
#define DMA_INTFCLR_TERRCLR2                                        DMA_INTFCLR_TERRCLR2_Msk                                       /*!< Channel 2 Transfer error clear */
#define DMA_INTFCLR_GINTCLR3_Pos                                    (8U)
#define DMA_INTFCLR_GINTCLR3_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR3_Pos)                            /*!< 0x00000100 */
#define DMA_INTFCLR_GINTCLR3                                        DMA_INTFCLR_GINTCLR3_Msk                                       /*!< Channel 3 Global interrupt clear */
#define DMA_INTFCLR_TCCLR3_Pos                                      (9U)
#define DMA_INTFCLR_TCCLR3_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR3_Pos)                              /*!< 0x00000200 */
#define DMA_INTFCLR_TCCLR3                                          DMA_INTFCLR_TCCLR3_Msk                                         /*!< Channel 3 Transfer complete clear */
#define DMA_INTFCLR_HTCLR3_Pos                                      (10U)
#define DMA_INTFCLR_HTCLR3_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR3_Pos)                              /*!< 0x00000400 */
#define DMA_INTFCLR_HTCLR3                                          DMA_INTFCLR_HTCLR3_Msk                                         /*!< Channel 3 Half transfer clear */
#define DMA_INTFCLR_TERRCLR3_Pos                                    (11U)
#define DMA_INTFCLR_TERRCLR3_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR3_Pos)                            /*!< 0x00000800 */
#define DMA_INTFCLR_TERRCLR3                                        DMA_INTFCLR_TERRCLR3_Msk                                       /*!< Channel 3 Transfer error clear */
#define DMA_INTFCLR_GINTCLR4_Pos                                    (12U)
#define DMA_INTFCLR_GINTCLR4_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR4_Pos)                            /*!< 0x00001000 */
#define DMA_INTFCLR_GINTCLR4                                        DMA_INTFCLR_GINTCLR4_Msk                                       /*!< Channel 4 Global interrupt clear */
#define DMA_INTFCLR_TCCLR4_Pos                                      (13U)
#define DMA_INTFCLR_TCCLR4_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR4_Pos)                              /*!< 0x00002000 */
#define DMA_INTFCLR_TCCLR4                                          DMA_INTFCLR_TCCLR4_Msk                                         /*!< Channel 4 Transfer complete clear */
#define DMA_INTFCLR_HTCLR4_Pos                                      (14U)
#define DMA_INTFCLR_HTCLR4_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR4_Pos)                              /*!< 0x00004000 */
#define DMA_INTFCLR_HTCLR4                                          DMA_INTFCLR_HTCLR4_Msk                                         /*!< Channel 4 Half transfer clear */
#define DMA_INTFCLR_TERRCLR4_Pos                                    (15U)
#define DMA_INTFCLR_TERRCLR4_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR4_Pos)                            /*!< 0x00008000 */
#define DMA_INTFCLR_TERRCLR4                                        DMA_INTFCLR_TERRCLR4_Msk                                       /*!< Channel 4 Transfer error clear */
#define DMA_INTFCLR_GINTCLR5_Pos                                    (16U)
#define DMA_INTFCLR_GINTCLR5_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR5_Pos)                            /*!< 0x00010000 */
#define DMA_INTFCLR_GINTCLR5                                        DMA_INTFCLR_GINTCLR5_Msk                                       /*!< Channel 5 Global interrupt clear */
#define DMA_INTFCLR_TCCLR5_Pos                                      (17U)
#define DMA_INTFCLR_TCCLR5_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR5_Pos)                              /*!< 0x00020000 */
#define DMA_INTFCLR_TCCLR5                                          DMA_INTFCLR_TCCLR5_Msk                                         /*!< Channel 5 Transfer complete clear */
#define DMA_INTFCLR_HTCLR5_Pos                                      (18U)
#define DMA_INTFCLR_HTCLR5_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR5_Pos)                              /*!< 0x00040000 */
#define DMA_INTFCLR_HTCLR5                                          DMA_INTFCLR_HTCLR5_Msk                                         /*!< Channel 5 Half transfer clear */
#define DMA_INTFCLR_TERRCLR5_Pos                                    (19U)
#define DMA_INTFCLR_TERRCLR5_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR5_Pos)                            /*!< 0x00080000 */
#define DMA_INTFCLR_TERRCLR5                                        DMA_INTFCLR_TERRCLR5_Msk                                       /*!< Channel 5 Transfer error clear */
#define DMA_INTFCLR_GINTCLR6_Pos                                    (20U)
#define DMA_INTFCLR_GINTCLR6_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR6_Pos)                            /*!< 0x00100000 */
#define DMA_INTFCLR_GINTCLR6                                        DMA_INTFCLR_GINTCLR6_Msk                                       /*!< Channel 6 Global interrupt clear */
#define DMA_INTFCLR_TCCLR6_Pos                                      (21U)
#define DMA_INTFCLR_TCCLR6_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR6_Pos)                              /*!< 0x00200000 */
#define DMA_INTFCLR_TCCLR6                                          DMA_INTFCLR_TCCLR6_Msk                                         /*!< Channel 6 Transfer complete clear */
#define DMA_INTFCLR_HTCLR6_Pos                                      (22U)
#define DMA_INTFCLR_HTCLR6_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR6_Pos)                              /*!< 0x00400000 */
#define DMA_INTFCLR_HTCLR6                                          DMA_INTFCLR_HTCLR6_Msk                                         /*!< Channel 6 Half transfer clear */
#define DMA_INTFCLR_TERRCLR6_Pos                                    (23U)
#define DMA_INTFCLR_TERRCLR6_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR6_Pos)                            /*!< 0x00800000 */
#define DMA_INTFCLR_TERRCLR6                                        DMA_INTFCLR_TERRCLR6_Msk                                       /*!< Channel 6 Transfer error clear */
#define DMA_INTFCLR_GINTCLR7_Pos                                    (24U)
#define DMA_INTFCLR_GINTCLR7_Msk                                    (0x1UL << DMA_INTFCLR_GINTCLR7_Pos)                            /*!< 0x01000000 */
#define DMA_INTFCLR_GINTCLR7                                        DMA_INTFCLR_GINTCLR7_Msk                                       /*!< Channel 7 Global interrupt clear */
#define DMA_INTFCLR_TCCLR7_Pos                                      (25U)
#define DMA_INTFCLR_TCCLR7_Msk                                      (0x1UL << DMA_INTFCLR_TCCLR7_Pos)                              /*!< 0x02000000 */
#define DMA_INTFCLR_TCCLR7                                          DMA_INTFCLR_TCCLR7_Msk                                         /*!< Channel 7 Transfer complete clear */
#define DMA_INTFCLR_HTCLR7_Pos                                      (26U)
#define DMA_INTFCLR_HTCLR7_Msk                                      (0x1UL << DMA_INTFCLR_HTCLR7_Pos)                              /*!< 0x04000000 */
#define DMA_INTFCLR_HTCLR7                                          DMA_INTFCLR_HTCLR7_Msk                                         /*!< Channel 7 Half transfer clear */
#define DMA_INTFCLR_TERRCLR7_Pos                                    (27U)
#define DMA_INTFCLR_TERRCLR7_Msk                                    (0x1UL << DMA_INTFCLR_TERRCLR7_Pos)                            /*!< 0x08000000 */
#define DMA_INTFCLR_TERRCLR7                                        DMA_INTFCLR_TERRCLR7_Msk                                       /*!< Channel 7 Transfer error clear */

