xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bits definition for FMC_ADDR register  *******************/
#define FLASH_ADDR_ADDR_Pos                                        (0U)
#define FLASH_ADDR_ADDR_Msk                                        (0xFFFFFFFFUL << FLASH_ADDR_ADDR_Pos)                           /*!< 0xFFFFFFFF */
#define FLASH_ADDR_ADDR                                            FLASH_ADDR_ADDR_Msk                                             /*!<Flash address */

/*******************  Bits definition for FMC_OBCS register  *******************/
#define FLASH_OBCS_OBE_Pos                                          (0U)
#define FLASH_OBCS_OBE_Msk                                          (0x1UL << FLASH_OBCS_OBE_Pos)                                  /*!< 0x00000001 */
#define FLASH_OBCS_OBE                                              FLASH_OBCS_OBE_Msk                                             /*!<Option byte error */
#define FLASH_OBCS_READPROT_Pos                                     (1U)
#define FLASH_OBCS_READPROT_Msk                                     (0x1UL << FLASH_OBCS_READPROT_Pos)                             /*!< 0x00000002 */
#define FLASH_OBCS_READPROT                                         FLASH_OBCS_READPROT_Msk                                        /*!<Read protection */
#define FLASH_OBCS_WDT_SEL_Pos                                      (2U)
#define FLASH_OBCS_WDT_SEL_Msk                                      (0x1UL << FLASH_OBCS_WDT_SEL_Pos)                              /*!< 0x00000004 */
#define FLASH_OBCS_WDT_SEL                                          FLASH_OBCS_WDT_SEL_Msk                                         /*!<IWDT select */
#define FLASH_OBCS_nRST_STOP_Pos                                    (3U)
#define FLASH_OBCS_nRST_STOP_Msk                                    (0x1UL << FLASH_OBCS_nRST_STOP_Pos)                            /*!< 0x00000008 */
#define FLASH_OBCS_nRST_STOP                                        FLASH_OBCS_nRST_STOP_Msk                                       /*!<nRST_STOP */
#define FLASH_OBCS_nRST_STDBY_Pos                                   (4U)
#define FLASH_OBCS_nRST_STDBY_Msk                                   (0x1UL << FLASH_OBCS_nRST_STDBY_Pos)                           /*!< 0x00000010 */
#define FLASH_OBCS_nRST_STDBY                                       FLASH_OBCS_nRST_STDBY_Msk                                      /*!<nRST_STDBY */
#define FLASH_OBCS_nROM_SEL_Pos                                     (6)
#define FLASH_OBCS_nROM_SEL_Msk                                     (0x1UL << FLASH_OBCS_nROM_SEL_Pos)                             /*!< 0x00000040 */
#define FLASH_OBCS_nROM_SEL                                         FLASH_OBCS_nROM_SEL_Msk                                        /*!<nROM_SEL */
#define FLASH_OBCS_UOB_Pos                                          (2U)
#define FLASH_OBCS_UOB_Msk                                          (0x17UL << FLASH_OBCS_UOB_Pos)                                 /*!< 0x0000005C */
#define FLASH_OBCS_UOB                                              FLASH_OBCS_UOB_Msk                                             /*!<User option byte */
#define FLASH_OBCS_DATA0_Pos                                        (10U)
#define FLASH_OBCS_DATA0_Msk                                        (0xFFUL << FLASH_OBCS_DATA0_Pos)                               /*!< 0x0003FC00 */
#define FLASH_OBCS_DATA0                                            FLASH_OBCS_DATA0_Msk                                           /*!<User data 0 */
#define FLASH_OBCS_DATA1_Pos                                        (18U)
#define FLASH_OBCS_DATA1_Msk                                        (0xFFUL << FLASH_OBCS_DATA1_Pos)                               /*!< 0x03FC0000 */
#define FLASH_OBCS_DATA1                                            FLASH_OBCS_DATA1_Msk                                           /*!<User data 1 */

/*******************  Bits definition for FMC_WRTPROT register  *******************/
#define FLASH_WRTPROT_WRTPROT_Pos                                   (0U)
#define FLASH_WRTPROT_WRTPROT_Msk                                   (0xFFFFFFFFUL << FLASH_WRTPROT_WRTPROT_Pos)                    /*!< 0xFFFFFFFF */
#define FLASH_WRTPROT_WRTPROT                                       FLASH_WRTPROT_WRTPROT_Msk                                      /*!<Write protection */

/*******************  Bits definition for FMC_READPROT register  *******************/
#define FLASH_READPROT_READPROT_Pos                                 (0U)
#define FLASH_READPROT_READPROT_Msk                                 (0xFFUL << FLASH_READPROT_READPROT_Pos)                        /*!< 0x000000FF */
#define FLASH_READPROT_READPROT                                     FLASH_READPROT_READPROT_Msk                                    /*!<Read protection option byte */
#define FLASH_READPROT_nREADPROT_Pos                                (8U)
#define FLASH_READPROT_nREADPROT_Msk                                (0xFFUL << FLASH_READPROT_nREADPROT_Pos)                       /*!< 0x0000FF00 */
#define FLASH_READPROT_nREADPROT                                    FLASH_READPROT_nREADPROT_Msk                                   /*!<Read protection complemented option byte */

/*******************  Bits definition for FMC_UOB register  *******************/
#define FLASH_UOB_UOB_Pos                                           (16U)
#define FLASH_UOB_UOB_Msk                                           (0xFFUL << FLASH_UOB_UOB_Pos)                                  /*!< 0x00FF0000 */
#define FLASH_UOB_UOB                                               FLASH_UOB_UOB_Msk                                              /*!<User option byte */
#define FLASH_UOB_nUOB_Pos                                          (24U)
#define FLASH_UOB_nUOB_Msk                                          (0xFFUL << FLASH_UOB_nUOB_Pos)                                 /*!< 0xFF000000 */
#define FLASH_UOB_nUOB                                              FLASH_UOB_nUOB_Msk                                             /*!<User option byte complemented */

