xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bits definition for FMC_DATA0 register  *******************/
#define FLASH_DATA0_DATA0_Pos                                       (0U)
#define FLASH_DATA0_DATA0_Msk                                       (0xFFUL << FLASH_DATA0_DATA0_Pos)                              /*!< 0x000000FF */
#define FLASH_DATA0_DATA0                                           FLASH_DATA0_DATA0_Msk                                          /*!<User data storage option byte */
#define FLASH_DATA0_nDATA0_Pos                                      (8U)
#define FLASH_DATA0_nDATA0_Msk                                      (0xFFUL << FLASH_DATA0_nDATA0_Pos)                             /*!< 0x0000FF00 */
#define FLASH_DATA0_nDATA0                                          FLASH_DATA0_nDATA0_Msk                                         /*!<User data storage complemented option byte */

/*******************  Bits definition for FMC_DATA1 register  *******************/
#define FLASH_DATA1_DATA1_Pos                                       (16U)
#define FLASH_DATA1_DATA1_Msk                                       (0xFFUL << FLASH_DATA1_DATA1_Pos)                              /*!< 0x00FF0000 */
#define FLASH_DATA1_DATA1                                           FLASH_DATA1_DATA1_Msk                                          /*!<User data storage option byte */
#define FLASH_DATA1_nDATA1_Pos                                      (24U)
#define FLASH_DATA1_nDATA1_Msk                                      (0xFFUL << FLASH_DATA1_nDATA1_Pos)                             /*!< 0xFF000000 */
#define FLASH_DATA1_nDATA1                                          FLASH_DATA1_nDATA1_Msk                                         /*!<User data storage complemented option byte */

/*******************  Bits definition for FMC_WRP0 register  *******************/
#define FLASH_WRP0_WRP0_Pos                                         (0U)
#define FLASH_WRP0_WRP0_Msk                                         (0xFFUL << FLASH_WRP0_WRP0_Pos)                                /*!< 0x000000FF */
#define FLASH_WRP0_WRP0                                             FLASH_WRP0_WRP0_Msk                                            /*!<Flash memory write protection option byte */
#define FLASH_WRP0_nWRP0_Pos                                        (8U)
#define FLASH_WRP0_nWRP0_Msk                                        (0xFFUL << FLASH_WRP0_nWRP0_Pos)                               /*!< 0x0000FF00 */
#define FLASH_WRP0_nWRP0                                            FLASH_WRP0_nWRP0_Msk                                           /*!<Flash memory write protection complemented option byte */

/*******************  Bits definition for FMC_WRP1 register  *******************/
#define FLASH_WRP1_WRP1_Pos                                         (16U)
#define FLASH_WRP1_WRP1_Msk                                         (0xFFUL << FLASH_WRP1_WRP1_Pos)                                /*!< 0x00FF0000 */
#define FLASH_WRP1_WRP1                                             FLASH_WRP1_WRP1_Msk                                            /*!<Flash memory write protection option byte */
#define FLASH_WRP1_nWRP1_Pos                                        (24U)
#define FLASH_WRP1_nWRP1_Msk                                        (0xFFUL << FLASH_WRP1_nWRP1_Pos)                               /*!< 0xFF000000 */
#define FLASH_WRP1_nWRP1                                            FLASH_WRP1_nWRP1_Msk                                           /*!<Flash memory write protection complemented option byte */

/*******************  Bits definition for FMC_WRP2 register  *******************/
#define FLASH_WRP2_WRP2_Pos                                         (0U)
#define FLASH_WRP2_WRP2_Msk                                         (0xFFUL << FLASH_WRP2_WRP2_Pos)                                /*!< 0x000000FF */
#define FLASH_WRP2_WRP2                                             FLASH_WRP2_WRP2_Msk                                            /*!<Flash memory write protection option byte */
#define FLASH_WRP2_nWRP2_Pos                                        (8U)
#define FLASH_WRP2_nWRP2_Msk                                        (0xFFUL << FLASH_WRP2_nWRP2_Pos)                               /*!< 0x0000FF00 */
#define FLASH_WRP2_nWRP2                                            FLASH_WRP2_nWRP2_Msk                                           /*!<Flash memory write protection complemented option byte */

/*******************  Bits definition for FMC_WRP3 register  *******************/
#define FLASH_WRP3_WRP3_Pos                                         (16U)
#define FLASH_WRP3_WRP3_Msk                                         (0xFFUL << FLASH_WRP3_WRP3_Pos)                                /*!< 0x00FF0000 */
#define FLASH_WRP3_WRP3                                             FLASH_WRP3_WRP3_Msk                                            /*!<Flash memory write protection option byte */
#define FLASH_WRP3_nWRP3_Pos                                        (24U)
#define FLASH_WRP3_nWRP3_Msk                                        (0xFFUL << FLASH_WRP3_nWRP3_Pos)                               /*!< 0xFF000000 */
#define FLASH_WRP3_nWRP3                                            FLASH_WRP3_nWRP3_Msk                                           /*!<Flash memory write protection complemented option byte */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_CFGLOW register  *****************/
#define GPIO_CFGLOW_MODE_Pos                                        (0U)
#define GPIO_CFGLOW_MODE_Msk                                        (0x33333333UL << GPIO_CFGLOW_MODE_Pos)                        /*!< 0x33333333 */
#define GPIO_CFGLOW_MODE                                            GPIO_CFGLOW_MODE_Msk                                           /*!<Port x mode bits */

#define GPIO_CFGLOW_MODE0_Pos                                       (0U)
#define GPIO_CFGLOW_MODE0_Msk                                       (0x3UL << GPIO_CFGLOW_MODE0_Pos)                               /*!< 0x00000003 */
#define GPIO_CFGLOW_MODE0                                           GPIO_CFGLOW_MODE0_Msk                                          /*!<MODE0[1:0] bits (Port x mode bits, pin 0) */
#define GPIO_CFGLOW_MODE0_0                                         (0x1UL << GPIO_CFGLOW_MODE0_Pos)                               /*!< 0x00000001 */
#define GPIO_CFGLOW_MODE0_1                                         (0x2UL << GPIO_CFGLOW_MODE0_Pos)                               /*!< 0x00000002 */

#define GPIO_CFGLOW_MODE1_Pos                                       (4U)
#define GPIO_CFGLOW_MODE1_Msk                                       (0x3UL << GPIO_CFGLOW_MODE1_Pos)                               /*!< 0x00000030 */
#define GPIO_CFGLOW_MODE1                                           GPIO_CFGLOW_MODE1_Msk                                          /*!<MODE1[1:0] bits (Port x mode bits, pin 1) */
#define GPIO_CFGLOW_MODE1_0                                         (0x1UL << GPIO_CFGLOW_MODE1_Pos)                               /*!< 0x00000010 */
#define GPIO_CFGLOW_MODE1_1                                         (0x2UL << GPIO_CFGLOW_MODE1_Pos)                               /*!< 0x00000020 */

#define GPIO_CFGLOW_MODE2_Pos                                       (8U)
#define GPIO_CFGLOW_MODE2_Msk                                       (0x3UL << GPIO_CFGLOW_MODE2_Pos)                               /*!< 0x00000300 */
#define GPIO_CFGLOW_MODE2                                           GPIO_CFGLOW_MODE2_Msk                                          /*!<MODE2[1:0] bits (Port x mode bits, pin 2) */
#define GPIO_CFGLOW_MODE2_0                                         (0x1UL << GPIO_CFGLOW_MODE2_Pos)                               /*!< 0x00000100 */
#define GPIO_CFGLOW_MODE2_1                                         (0x2UL << GPIO_CFGLOW_MODE2_Pos)                               /*!< 0x00000200 */

#define GPIO_CFGLOW_MODE3_Pos                                       (12U)
#define GPIO_CFGLOW_MODE3_Msk                                       (0x3UL << GPIO_CFGLOW_MODE3_Pos)                               /*!< 0x00003000 */
#define GPIO_CFGLOW_MODE3                                           GPIO_CFGLOW_MODE3_Msk                                          /*!<MODE3[1:0] bits (Port x mode bits, pin 3) */
#define GPIO_CFGLOW_MODE3_0                                         (0x1UL << GPIO_CFGLOW_MODE3_Pos)                               /*!< 0x00001000 */
#define GPIO_CFGLOW_MODE3_1                                         (0x2UL << GPIO_CFGLOW_MODE3_Pos)                               /*!< 0x00002000 */

#define GPIO_CFGLOW_MODE4_Pos                                       (16U)
#define GPIO_CFGLOW_MODE4_Msk                                       (0x3UL << GPIO_CFGLOW_MODE4_Pos)                               /*!< 0x00030000 */
#define GPIO_CFGLOW_MODE4                                           GPIO_CFGLOW_MODE4_Msk                                          /*!<MODE4[1:0] bits (Port x mode bits, pin 4) */
#define GPIO_CFGLOW_MODE4_0                                         (0x1UL << GPIO_CFGLOW_MODE4_Pos)                               /*!< 0x00010000 */
#define GPIO_CFGLOW_MODE4_1                                         (0x2UL << GPIO_CFGLOW_MODE4_Pos)                               /*!< 0x00020000 */

#define GPIO_CFGLOW_MODE5_Pos                                       (20U)
#define GPIO_CFGLOW_MODE5_Msk                                       (0x3UL << GPIO_CFGLOW_MODE5_Pos)                               /*!< 0x00300000 */
#define GPIO_CFGLOW_MODE5                                           GPIO_CFGLOW_MODE5_Msk                                          /*!<MODE5[1:0] bits (Port x mode bits, pin 5) */
#define GPIO_CFGLOW_MODE5_0                                         (0x1UL << GPIO_CFGLOW_MODE5_Pos)                               /*!< 0x00100000 */
#define GPIO_CFGLOW_MODE5_1                                         (0x2UL << GPIO_CFGLOW_MODE5_Pos)                               /*!< 0x00200000 */

#define GPIO_CFGLOW_MODE6_Pos                                       (24U)
#define GPIO_CFGLOW_MODE6_Msk                                       (0x3UL << GPIO_CFGLOW_MODE6_Pos)                               /*!< 0x03000000 */
#define GPIO_CFGLOW_MODE6                                           GPIO_CFGLOW_MODE6_Msk                                          /*!<MODE6[1:0] bits (Port x mode bits, pin 6) */
#define GPIO_CFGLOW_MODE6_0                                         (0x1UL << GPIO_CFGLOW_MODE6_Pos)                               /*!< 0x01000000 */
#define GPIO_CFGLOW_MODE6_1                                         (0x2UL << GPIO_CFGLOW_MODE6_Pos)                               /*!< 0x02000000 */

#define GPIO_CFGLOW_MODE7_Pos                                       (28U)
#define GPIO_CFGLOW_MODE7_Msk                                       (0x3UL << GPIO_CFGLOW_MODE7_Pos)                               /*!< 0x30000000 */
#define GPIO_CFGLOW_MODE7                                           GPIO_CFGLOW_MODE7_Msk                                          /*!<MODE7[1:0] bits (Port x mode bits, pin 7) */
#define GPIO_CFGLOW_MODE7_0                                         (0x1UL << GPIO_CFGLOW_MODE7_Pos)                               /*!< 0x10000000 */
#define GPIO_CFGLOW_MODE7_1                                         (0x2UL << GPIO_CFGLOW_MODE7_Pos)                               /*!< 0x20000000 */

