xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define GPIO_CFGLOW_CFG_Pos                                         (2U)
#define GPIO_CFGLOW_CFG_Msk                                         (0x33333333UL << GPIO_CFGLOW_CFG_Pos)                          /*!< 0xCCCCCCCC */
#define GPIO_CFGLOW_CFG                                             GPIO_CFGLOW_CFG_Msk                                            /*!<Port x configuration bits */

#define GPIO_CFGLOW_CFG0_Pos                                        (2U)
#define GPIO_CFGLOW_CFG0_Msk                                        (0x3UL << GPIO_CFGLOW_CFG0_Pos)                                /*!< 0x0000000C */
#define GPIO_CFGLOW_CFG0                                            GPIO_CFGLOW_CFG0_Msk                                           /*!<CFG0[1:0] bits (Port x configuration bits, pin 0) */
#define GPIO_CFGLOW_CFG0_0                                          (0x1UL << GPIO_CFGLOW_CFG0_Pos)                                /*!< 0x00000004 */
#define GPIO_CFGLOW_CFG0_1                                          (0x2UL << GPIO_CFGLOW_CFG0_Pos)                                /*!< 0x00000008 */

#define GPIO_CFGLOW_CFG1_Pos                                        (6U)
#define GPIO_CFGLOW_CFG1_Msk                                        (0x3UL << GPIO_CFGLOW_CFG1_Pos)                                /*!< 0x000000C0 */
#define GPIO_CFGLOW_CFG1                                            GPIO_CFGLOW_CFG1_Msk                                           /*!<CFG1[1:0] bits (Port x configuration bits, pin 1) */
#define GPIO_CFGLOW_CFG1_0                                          (0x1UL << GPIO_CFGLOW_CFG1_Pos)                                /*!< 0x00000040 */
#define GPIO_CFGLOW_CFG1_1                                          (0x2UL << GPIO_CFGLOW_CFG1_Pos)                                /*!< 0x00000080 */

#define GPIO_CFGLOW_CFG2_Pos                                        (10U)
#define GPIO_CFGLOW_CFG2_Msk                                        (0x3UL << GPIO_CFGLOW_CFG2_Pos)                                /*!< 0x00000C00 */
#define GPIO_CFGLOW_CFG2                                            GPIO_CFGLOW_CFG2_Msk                                           /*!<CFG2[1:0] bits (Port x configuration bits, pin 2) */
#define GPIO_CFGLOW_CFG2_0                                          (0x1UL << GPIO_CFGLOW_CFG2_Pos)                                /*!< 0x00000400 */
#define GPIO_CFGLOW_CFG2_1                                          (0x2UL << GPIO_CFGLOW_CFG2_Pos)                                /*!< 0x00000800 */

#define GPIO_CFGLOW_CFG3_Pos                                        (14U)
#define GPIO_CFGLOW_CFG3_Msk                                        (0x3UL << GPIO_CFGLOW_CFG3_Pos)                                /*!< 0x0000C000 */
#define GPIO_CFGLOW_CFG3                                            GPIO_CFGLOW_CFG3_Msk                                           /*!<CFG3[1:0] bits (Port x configuration bits, pin 3) */
#define GPIO_CFGLOW_CFG3_0                                          (0x1UL << GPIO_CFGLOW_CFG3_Pos)                                /*!< 0x00004000 */
#define GPIO_CFGLOW_CFG3_1                                          (0x2UL << GPIO_CFGLOW_CFG3_Pos)                                /*!< 0x00008000 */

#define GPIO_CFGLOW_CFG4_Pos                                        (18U)
#define GPIO_CFGLOW_CFG4_Msk                                        (0x3UL << GPIO_CFGLOW_CFG4_Pos)                                /*!< 0x000C0000 */
#define GPIO_CFGLOW_CFG4                                            GPIO_CFGLOW_CFG4_Msk                                           /*!<CFG4[1:0] bits (Port x configuration bits, pin 4) */
#define GPIO_CFGLOW_CFG4_0                                          (0x1UL << GPIO_CFGLOW_CFG4_Pos)                                /*!< 0x00040000 */
#define GPIO_CFGLOW_CFG4_1                                          (0x2UL << GPIO_CFGLOW_CFG4_Pos)                                /*!< 0x00080000 */

#define GPIO_CFGLOW_CFG5_Pos                                        (22U)
#define GPIO_CFGLOW_CFG5_Msk                                        (0x3UL << GPIO_CFGLOW_CFG5_Pos)                                /*!< 0x00C00000 */
#define GPIO_CFGLOW_CFG5                                            GPIO_CFGLOW_CFG5_Msk                                           /*!<CFG5[1:0] bits (Port x configuration bits, pin 5) */
#define GPIO_CFGLOW_CFG5_0                                          (0x1UL << GPIO_CFGLOW_CFG5_Pos)                                /*!< 0x00400000 */
#define GPIO_CFGLOW_CFG5_1                                          (0x2UL << GPIO_CFGLOW_CFG5_Pos)                                /*!< 0x00800000 */

#define GPIO_CFGLOW_CFG6_Pos                                        (26U)
#define GPIO_CFGLOW_CFG6_Msk                                        (0x3UL << GPIO_CFGLOW_CFG6_Pos)                                /*!< 0x0C000000 */
#define GPIO_CFGLOW_CFG6                                            GPIO_CFGLOW_CFG6_Msk                                           /*!<CFG6[1:0] bits (Port x configuration bits, pin 6) */
#define GPIO_CFGLOW_CFG6_0                                          (0x1UL << GPIO_CFGLOW_CFG6_Pos)                                /*!< 0x04000000 */
#define GPIO_CFGLOW_CFG6_1                                          (0x2UL << GPIO_CFGLOW_CFG6_Pos)                                /*!< 0x08000000 */

#define GPIO_CFGLOW_CFG7_Pos                                        (30U)
#define GPIO_CFGLOW_CFG7_Msk                                        (0x3UL << GPIO_CFGLOW_CFG7_Pos)                                /*!< 0xC0000000 */
#define GPIO_CFGLOW_CFG7                                            GPIO_CFGLOW_CFG7_Msk                                           /*!<CFG7[1:0] bits (Port x configuration bits, pin 7) */
#define GPIO_CFGLOW_CFG7_0                                          (0x1UL << GPIO_CFGLOW_CFG7_Pos)                                /*!< 0x40000000 */
#define GPIO_CFGLOW_CFG7_1                                          (0x2UL << GPIO_CFGLOW_CFG7_Pos)                                /*!< 0x80000000 */

/******************  Bits definition for GPIO_CFGHIG register  ******************/
#define GPIO_CFGHIG_MODE_Pos                                        (0U)
#define GPIO_CFGHIG_MODE_Msk                                        (0x33333333UL << GPIO_CFGHIG_MODE_Pos)                        /*!< 0x33333333 */
#define GPIO_CFGHIG_MODE                                            GPIO_CFGHIG_MODE_Msk                                           /*!<Port x mode bits */

#define GPIO_CFGHIG_MODE8_Pos                                       (0U)
#define GPIO_CFGHIG_MODE8_Msk                                       (0x3UL << GPIO_CFGHIG_MODE8_Pos)                               /*!< 0x00000003 */
#define GPIO_CFGHIG_MODE8                                           GPIO_CFGHIG_MODE8_Msk                                          /*!<MODE8[1:0] bits (Port x mode bits, pin 8) */
#define GPIO_CFGHIG_MODE8_0                                         (0x1UL << GPIO_CFGHIG_MODE8_Pos)                               /*!< 0x00000001 */
#define GPIO_CFGHIG_MODE8_1                                         (0x2UL << GPIO_CFGHIG_MODE8_Pos)                               /*!< 0x00000002 */

#define GPIO_CFGHIG_MODE9_Pos                                       (4U)
#define GPIO_CFGHIG_MODE9_Msk                                       (0x3UL << GPIO_CFGHIG_MODE9_Pos)                               /*!< 0x00000030 */
#define GPIO_CFGHIG_MODE9                                           GPIO_CFGHIG_MODE9_Msk                                          /*!<MODE9[1:0] bits (Port x mode bits, pin 9) */
#define GPIO_CFGHIG_MODE9_0                                         (0x1UL << GPIO_CFGHIG_MODE9_Pos)                               /*!< 0x00000010 */
#define GPIO_CFGHIG_MODE9_1                                         (0x2UL << GPIO_CFGHIG_MODE9_Pos)                               /*!< 0x00000020 */

#define GPIO_CFGHIG_MODE10_Pos                                      (8U)
#define GPIO_CFGHIG_MODE10_Msk                                      (0x3UL << GPIO_CFGHIG_MODE10_Pos)                              /*!< 0x00000300 */
#define GPIO_CFGHIG_MODE10                                          GPIO_CFGHIG_MODE10_Msk                                         /*!<MODE10[1:0] bits (Port x mode bits, pin 10) */
#define GPIO_CFGHIG_MODE10_0                                        (0x1UL << GPIO_CFGHIG_MODE10_Pos)                              /*!< 0x00000100 */
#define GPIO_CFGHIG_MODE10_1                                        (0x2UL << GPIO_CFGHIG_MODE10_Pos)                              /*!< 0x00000200 */

#define GPIO_CFGHIG_MODE11_Pos                                      (12U)
#define GPIO_CFGHIG_MODE11_Msk                                      (0x3UL << GPIO_CFGHIG_MODE11_Pos)                              /*!< 0x00003000 */
#define GPIO_CFGHIG_MODE11                                          GPIO_CFGHIG_MODE11_Msk                                         /*!<MODE11[1:0] bits (Port x mode bits, pin 11) */
#define GPIO_CFGHIG_MODE11_0                                        (0x1UL << GPIO_CFGHIG_MODE11_Pos)                              /*!< 0x00001000 */
#define GPIO_CFGHIG_MODE11_1                                        (0x2UL << GPIO_CFGHIG_MODE11_Pos)                              /*!< 0x00002000 */

#define GPIO_CFGHIG_MODE12_Pos                                      (16U)
#define GPIO_CFGHIG_MODE12_Msk                                      (0x3UL << GPIO_CFGHIG_MODE12_Pos)                              /*!< 0x00030000 */
#define GPIO_CFGHIG_MODE12                                          GPIO_CFGHIG_MODE12_Msk                                         /*!<MODE12[1:0] bits (Port x mode bits, pin 12) */
#define GPIO_CFGHIG_MODE12_0                                        (0x1UL << GPIO_CFGHIG_MODE12_Pos)                              /*!< 0x00010000 */
#define GPIO_CFGHIG_MODE12_1                                        (0x2UL << GPIO_CFGHIG_MODE12_Pos)                              /*!< 0x00020000 */

#define GPIO_CFGHIG_MODE13_Pos                                      (20U)
#define GPIO_CFGHIG_MODE13_Msk                                      (0x3UL << GPIO_CFGHIG_MODE13_Pos)                              /*!< 0x00300000 */
#define GPIO_CFGHIG_MODE13                                          GPIO_CFGHIG_MODE13_Msk                                         /*!<MODE13[1:0] bits (Port x mode bits, pin 13) */
#define GPIO_CFGHIG_MODE13_0                                        (0x1UL << GPIO_CFGHIG_MODE13_Pos)                              /*!< 0x00100000 */
#define GPIO_CFGHIG_MODE13_1                                        (0x2UL << GPIO_CFGHIG_MODE13_Pos)                              /*!< 0x00200000 */

#define GPIO_CFGHIG_MODE14_Pos                                      (24U)
#define GPIO_CFGHIG_MODE14_Msk                                      (0x3UL << GPIO_CFGHIG_MODE14_Pos)                              /*!< 0x03000000 */
#define GPIO_CFGHIG_MODE14                                          GPIO_CFGHIG_MODE14_Msk                                         /*!<MODE14[1:0] bits (Port x mode bits, pin 14) */
#define GPIO_CFGHIG_MODE14_0                                        (0x1UL << GPIO_CFGHIG_MODE14_Pos)                              /*!< 0x01000000 */
#define GPIO_CFGHIG_MODE14_1                                        (0x2UL << GPIO_CFGHIG_MODE14_Pos)                              /*!< 0x02000000 */

#define GPIO_CFGHIG_MODE15_Pos                                      (28U)
#define GPIO_CFGHIG_MODE15_Msk                                      (0x3UL << GPIO_CFGHIG_MODE15_Pos)                              /*!< 0x30000000 */
#define GPIO_CFGHIG_MODE15                                          GPIO_CFGHIG_MODE15_Msk                                         /*!<MODE15[1:0] bits (Port x mode bits, pin 15) */
#define GPIO_CFGHIG_MODE15_0                                        (0x1UL << GPIO_CFGHIG_MODE15_Pos)                              /*!< 0x10000000 */
#define GPIO_CFGHIG_MODE15_1                                        (0x2UL << GPIO_CFGHIG_MODE15_Pos)                              /*!< 0x20000000 */

