xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define GPIO_CFGHIG_CFG_Pos                                         (2U)
#define GPIO_CFGHIG_CFG_Msk                                         (0x33333333UL << GPIO_CFGHIG_CFG_Pos)                          /*!< 0xCCCCCCCC */
#define GPIO_CFGHIG_CFG                                             GPIO_CFGHIG_CFG_Msk                                            /*!<Port x configuration bits */

#define GPIO_CFGHIG_CFG8_Pos                                        (2U)
#define GPIO_CFGHIG_CFG8_Msk                                        (0x3UL << GPIO_CFGHIG_CFG8_Pos)                                /*!< 0x0000000C */
#define GPIO_CFGHIG_CFG8                                            GPIO_CFGHIG_CFG8_Msk                                           /*!<CFG8[1:0] bits (Port x configuration bits, pin 8) */
#define GPIO_CFGHIG_CFG8_0                                          (0x1UL << GPIO_CFGHIG_CFG8_Pos)                                /*!< 0x00000004 */
#define GPIO_CFGHIG_CFG8_1                                          (0x2UL << GPIO_CFGHIG_CFG8_Pos)                                /*!< 0x00000008 */

#define GPIO_CFGHIG_CFG9_Pos                                        (6U)
#define GPIO_CFGHIG_CFG9_Msk                                        (0x3UL << GPIO_CFGHIG_CFG9_Pos)                                /*!< 0x000000C0 */
#define GPIO_CFGHIG_CFG9                                            GPIO_CFGHIG_CFG9_Msk                                           /*!<CFG9[1:0] bits (Port x configuration bits, pin 9) */
#define GPIO_CFGHIG_CFG9_0                                          (0x1UL << GPIO_CFGHIG_CFG9_Pos)                                /*!< 0x00000040 */
#define GPIO_CFGHIG_CFG9_1                                          (0x2UL << GPIO_CFGHIG_CFG9_Pos)                                /*!< 0x00000080 */

#define GPIO_CFGHIG_CFG10_Pos                                       (10U)
#define GPIO_CFGHIG_CFG10_Msk                                       (0x3UL << GPIO_CFGHIG_CFG10_Pos)                               /*!< 0x00000C00 */
#define GPIO_CFGHIG_CFG10                                           GPIO_CFGHIG_CFG10_Msk                                          /*!<CFG10[1:0] bits (Port x configuration bits, pin 10) */
#define GPIO_CFGHIG_CFG10_0                                         (0x1UL << GPIO_CFGHIG_CFG10_Pos)                               /*!< 0x00000400 */
#define GPIO_CFGHIG_CFG10_1                                         (0x2UL << GPIO_CFGHIG_CFG10_Pos)                               /*!< 0x00000800 */

#define GPIO_CFGHIG_CFG11_Pos                                       (14U)
#define GPIO_CFGHIG_CFG11_Msk                                       (0x3UL << GPIO_CFGHIG_CFG11_Pos)                               /*!< 0x0000C000 */
#define GPIO_CFGHIG_CFG11                                           GPIO_CFGHIG_CFG11_Msk                                          /*!<CFG11[1:0] bits (Port x configuration bits, pin 11) */
#define GPIO_CFGHIG_CFG11_0                                         (0x1UL << GPIO_CFGHIG_CFG11_Pos)                               /*!< 0x00004000 */
#define GPIO_CFGHIG_CFG11_1                                         (0x2UL << GPIO_CFGHIG_CFG11_Pos)                               /*!< 0x00008000 */

#define GPIO_CFGHIG_CFG12_Pos                                       (18U)
#define GPIO_CFGHIG_CFG12_Msk                                       (0x3UL << GPIO_CFGHIG_CFG12_Pos)                               /*!< 0x000C0000 */
#define GPIO_CFGHIG_CFG12                                           GPIO_CFGHIG_CFG12_Msk                                          /*!<CFG12[1:0] bits (Port x configuration bits, pin 12) */
#define GPIO_CFGHIG_CFG12_0                                         (0x1UL << GPIO_CFGHIG_CFG12_Pos)                               /*!< 0x00010000 */
#define GPIO_CFGHIG_CFG12_1                                         (0x2UL << GPIO_CFGHIG_CFG12_Pos)                               /*!< 0x00020000 */

#define GPIO_CFGHIG_CFG13_Pos                                       (22U)
#define GPIO_CFGHIG_CFG13_Msk                                       (0x3UL << GPIO_CFGHIG_CFG13_Pos)                               /*!< 0x00C00000 */
#define GPIO_CFGHIG_CFG13                                           GPIO_CFGHIG_CFG13_Msk                                          /*!<CFG13[1:0] bits (Port x configuration bits, pin 13) */
#define GPIO_CFGHIG_CFG13_0                                         (0x1UL << GPIO_CFGHIG_CFG13_Pos)                               /*!< 0x00400000 */
#define GPIO_CFGHIG_CFG13_1                                         (0x2UL << GPIO_CFGHIG_CFG13_Pos)                               /*!< 0x00800000 */

#define GPIO_CFGHIG_CFG14_Pos                                       (26U)
#define GPIO_CFGHIG_CFG14_Msk                                       (0x3UL << GPIO_CFGHIG_CFG14_Pos)                               /*!< 0x0C000000 */
#define GPIO_CFGHIG_CFG14                                           GPIO_CFGHIG_CFG14_Msk                                          /*!<CFG14[1:0] bits (Port x configuration bits, pin 14) */
#define GPIO_CFGHIG_CFG14_0                                         (0x1UL << GPIO_CFGHIG_CFG14_Pos)                               /*!< 0x04000000 */
#define GPIO_CFGHIG_CFG14_1                                         (0x2UL << GPIO_CFGHIG_CFG14_Pos)                               /*!< 0x08000000 */

#define GPIO_CFGHIG_CFG15_Pos                                       (30U)
#define GPIO_CFGHIG_CFG15_Msk                                       (0x3UL << GPIO_CFGHIG_CFG15_Pos)                               /*!< 0xC0000000 */
#define GPIO_CFGHIG_CFG15                                           GPIO_CFGHIG_CFG15_Msk                                          /*!<CFG15[1:0] bits (Port x configuration bits, pin 15) */
#define GPIO_CFGHIG_CFG15_0                                         (0x1UL << GPIO_CFGHIG_CFG15_Pos)                               /*!< 0x40000000 */
#define GPIO_CFGHIG_CFG15_1                                         (0x2UL << GPIO_CFGHIG_CFG15_Pos)                               /*!< 0x80000000 */


/* Defines used for Pin Mask Initialization */
#define GPIO_PIN_MASK_POS                                            (8U)
#define GPIO_PIN_NB                                                  (16U)

/******************  Bits definition for GPIO_IDATA register  *******************/
#define GPIO_IDATA_IDATA0_Pos                                       (0U)
#define GPIO_IDATA_IDATA0_Msk                                       (0x1UL << GPIO_IDATA_IDATA0_Pos)                               /*!< 0x00000001 */
#define GPIO_IDATA_IDATA0                                           GPIO_IDATA_IDATA0_Msk                                          /*!< Port input data, bit 0 */
#define GPIO_IDATA_IDATA1_Pos                                       (1U)
#define GPIO_IDATA_IDATA1_Msk                                       (0x1UL << GPIO_IDATA_IDATA1_Pos)                               /*!< 0x00000002 */
#define GPIO_IDATA_IDATA1                                           GPIO_IDATA_IDATA1_Msk                                          /*!< Port input data, bit 1 */
#define GPIO_IDATA_IDATA2_Pos                                       (2U)
#define GPIO_IDATA_IDATA2_Msk                                       (0x1UL << GPIO_IDATA_IDATA2_Pos)                               /*!< 0x00000004 */
#define GPIO_IDATA_IDATA2                                           GPIO_IDATA_IDATA2_Msk                                          /*!< Port input data, bit 2 */
#define GPIO_IDATA_IDATA3_Pos                                       (3U)
#define GPIO_IDATA_IDATA3_Msk                                       (0x1UL << GPIO_IDATA_IDATA3_Pos)                               /*!< 0x00000008 */
#define GPIO_IDATA_IDATA3                                           GPIO_IDATA_IDATA3_Msk                                          /*!< Port input data, bit 3 */
#define GPIO_IDATA_IDATA4_Pos                                       (4U)
#define GPIO_IDATA_IDATA4_Msk                                       (0x1UL << GPIO_IDATA_IDATA4_Pos)                               /*!< 0x00000010 */
#define GPIO_IDATA_IDATA4                                           GPIO_IDATA_IDATA4_Msk                                          /*!< Port input data, bit 4 */
#define GPIO_IDATA_IDATA5_Pos                                       (5U)
#define GPIO_IDATA_IDATA5_Msk                                       (0x1UL << GPIO_IDATA_IDATA5_Pos)                               /*!< 0x00000020 */
#define GPIO_IDATA_IDATA5                                           GPIO_IDATA_IDATA5_Msk                                          /*!< Port input data, bit 5 */
#define GPIO_IDATA_IDATA6_Pos                                       (6U)
#define GPIO_IDATA_IDATA6_Msk                                       (0x1UL << GPIO_IDATA_IDATA6_Pos)                               /*!< 0x00000040 */
#define GPIO_IDATA_IDATA6                                           GPIO_IDATA_IDATA6_Msk                                          /*!< Port input data, bit 6 */
#define GPIO_IDATA_IDATA7_Pos                                       (7U)
#define GPIO_IDATA_IDATA7_Msk                                       (0x1UL << GPIO_IDATA_IDATA7_Pos)                               /*!< 0x00000080 */
#define GPIO_IDATA_IDATA7                                           GPIO_IDATA_IDATA7_Msk                                          /*!< Port input data, bit 7 */
#define GPIO_IDATA_IDATA8_Pos                                       (8U)
#define GPIO_IDATA_IDATA8_Msk                                       (0x1UL << GPIO_IDATA_IDATA8_Pos)                               /*!< 0x00000100 */
#define GPIO_IDATA_IDATA8                                           GPIO_IDATA_IDATA8_Msk                                          /*!< Port input data, bit 8 */
#define GPIO_IDATA_IDATA9_Pos                                       (9U)
#define GPIO_IDATA_IDATA9_Msk                                       (0x1UL << GPIO_IDATA_IDATA9_Pos)                               /*!< 0x00000200 */
#define GPIO_IDATA_IDATA9                                           GPIO_IDATA_IDATA9_Msk                                          /*!< Port input data, bit 9 */
#define GPIO_IDATA_IDATA10_Pos                                      (10U)
#define GPIO_IDATA_IDATA10_Msk                                      (0x1UL << GPIO_IDATA_IDATA10_Pos)                              /*!< 0x00000400 */
#define GPIO_IDATA_IDATA10                                          GPIO_IDATA_IDATA10_Msk                                         /*!< Port input data, bit 10 */
#define GPIO_IDATA_IDATA11_Pos                                      (11U)
#define GPIO_IDATA_IDATA11_Msk                                      (0x1UL << GPIO_IDATA_IDATA11_Pos)                              /*!< 0x00000800 */
#define GPIO_IDATA_IDATA11                                          GPIO_IDATA_IDATA11_Msk                                         /*!< Port input data, bit 11 */
#define GPIO_IDATA_IDATA12_Pos                                      (12U)
#define GPIO_IDATA_IDATA12_Msk                                      (0x1UL << GPIO_IDATA_IDATA12_Pos)                              /*!< 0x00001000 */
#define GPIO_IDATA_IDATA12                                          GPIO_IDATA_IDATA12_Msk                                         /*!< Port input data, bit 12 */
#define GPIO_IDATA_IDATA13_Pos                                      (13U)
#define GPIO_IDATA_IDATA13_Msk                                      (0x1UL << GPIO_IDATA_IDATA13_Pos)                              /*!< 0x00002000 */
#define GPIO_IDATA_IDATA13                                          GPIO_IDATA_IDATA13_Msk                                         /*!< Port input data, bit 13 */
#define GPIO_IDATA_IDATA14_Pos                                      (14U)
#define GPIO_IDATA_IDATA14_Msk                                      (0x1UL << GPIO_IDATA_IDATA14_Pos)                              /*!< 0x00004000 */
#define GPIO_IDATA_IDATA14                                          GPIO_IDATA_IDATA14_Msk                                         /*!< Port input data, bit 14 */
#define GPIO_IDATA_IDATA15_Pos                                      (15U)
#define GPIO_IDATA_IDATA15_Msk                                      (0x1UL << GPIO_IDATA_IDATA15_Pos)                              /*!< 0x00008000 */
#define GPIO_IDATA_IDATA15                                          GPIO_IDATA_IDATA15_Msk                                         /*!< Port input data, bit 15 */

/******************  Bits definition for GPIO_ODATA register  *******************/
#define GPIO_ODATA_ODATA0_Pos                                       (0U)
#define GPIO_ODATA_ODATA0_Msk                                       (0x1UL << GPIO_ODATA_ODATA0_Pos)                               /*!< 0x00000001 */
#define GPIO_ODATA_ODATA0                                           GPIO_ODATA_ODATA0_Msk                                          /*!< Port output data, bit 0 */
#define GPIO_ODATA_ODATA1_Pos                                       (1U)
#define GPIO_ODATA_ODATA1_Msk                                       (0x1UL << GPIO_ODATA_ODATA1_Pos)                               /*!< 0x00000002 */
#define GPIO_ODATA_ODATA1                                           GPIO_ODATA_ODATA1_Msk                                          /*!< Port output data, bit 1 */
#define GPIO_ODATA_ODATA2_Pos                                       (2U)
#define GPIO_ODATA_ODATA2_Msk                                       (0x1UL << GPIO_ODATA_ODATA2_Pos)                               /*!< 0x00000004 */
#define GPIO_ODATA_ODATA2                                           GPIO_ODATA_ODATA2_Msk                                          /*!< Port output data, bit 2 */
#define GPIO_ODATA_ODATA3_Pos                                       (3U)
#define GPIO_ODATA_ODATA3_Msk                                       (0x1UL << GPIO_ODATA_ODATA3_Pos)                               /*!< 0x00000008 */
#define GPIO_ODATA_ODATA3                                           GPIO_ODATA_ODATA3_Msk                                          /*!< Port output data, bit 3 */
#define GPIO_ODATA_ODATA4_Pos                                       (4U)
#define GPIO_ODATA_ODATA4_Msk                                       (0x1UL << GPIO_ODATA_ODATA4_Pos)                               /*!< 0x00000010 */
#define GPIO_ODATA_ODATA4                                           GPIO_ODATA_ODATA4_Msk                                          /*!< Port output data, bit 4 */
#define GPIO_ODATA_ODATA5_Pos                                       (5U)
#define GPIO_ODATA_ODATA5_Msk                                       (0x1UL << GPIO_ODATA_ODATA5_Pos)                               /*!< 0x00000020 */
#define GPIO_ODATA_ODATA5                                           GPIO_ODATA_ODATA5_Msk                                          /*!< Port output data, bit 5 */
#define GPIO_ODATA_ODATA6_Pos                                       (6U)
#define GPIO_ODATA_ODATA6_Msk                                       (0x1UL << GPIO_ODATA_ODATA6_Pos)                               /*!< 0x00000040 */
#define GPIO_ODATA_ODATA6                                           GPIO_ODATA_ODATA6_Msk                                          /*!< Port output data, bit 6 */
#define GPIO_ODATA_ODATA7_Pos                                       (7U)
#define GPIO_ODATA_ODATA7_Msk                                       (0x1UL << GPIO_ODATA_ODATA7_Pos)                               /*!< 0x00000080 */
#define GPIO_ODATA_ODATA7                                           GPIO_ODATA_ODATA7_Msk                                          /*!< Port output data, bit 7 */
#define GPIO_ODATA_ODATA8_Pos                                       (8U)
#define GPIO_ODATA_ODATA8_Msk                                       (0x1UL << GPIO_ODATA_ODATA8_Pos)                               /*!< 0x00000100 */
#define GPIO_ODATA_ODATA8                                           GPIO_ODATA_ODATA8_Msk                                          /*!< Port output data, bit 8 */
#define GPIO_ODATA_ODATA9_Pos                                       (9U)
#define GPIO_ODATA_ODATA9_Msk                                       (0x1UL << GPIO_ODATA_ODATA9_Pos)                               /*!< 0x00000200 */
#define GPIO_ODATA_ODATA9                                           GPIO_ODATA_ODATA9_Msk                                          /*!< Port output data, bit 9 */
#define GPIO_ODATA_ODATA10_Pos                                      (10U)
#define GPIO_ODATA_ODATA10_Msk                                      (0x1UL << GPIO_ODATA_ODATA10_Pos)                              /*!< 0x00000400 */
#define GPIO_ODATA_ODATA10                                          GPIO_ODATA_ODATA10_Msk                                         /*!< Port output data, bit 10 */
#define GPIO_ODATA_ODATA11_Pos                                      (11U)
#define GPIO_ODATA_ODATA11_Msk                                      (0x1UL << GPIO_ODATA_ODATA11_Pos)                              /*!< 0x00000800 */
#define GPIO_ODATA_ODATA11                                          GPIO_ODATA_ODATA11_Msk                                         /*!< Port output data, bit 11 */
#define GPIO_ODATA_ODATA12_Pos                                      (12U)
#define GPIO_ODATA_ODATA12_Msk                                      (0x1UL << GPIO_ODATA_ODATA12_Pos)                              /*!< 0x00001000 */
#define GPIO_ODATA_ODATA12                                          GPIO_ODATA_ODATA12_Msk                                         /*!< Port output data, bit 12 */
#define GPIO_ODATA_ODATA13_Pos                                      (13U)
#define GPIO_ODATA_ODATA13_Msk                                      (0x1UL << GPIO_ODATA_ODATA13_Pos)                              /*!< 0x00002000 */
#define GPIO_ODATA_ODATA13                                          GPIO_ODATA_ODATA13_Msk                                         /*!< Port output data, bit 13 */
#define GPIO_ODATA_ODATA14_Pos                                      (14U)
#define GPIO_ODATA_ODATA14_Msk                                      (0x1UL << GPIO_ODATA_ODATA14_Pos)                              /*!< 0x00004000 */
#define GPIO_ODATA_ODATA14                                          GPIO_ODATA_ODATA14_Msk                                         /*!< Port output data, bit 14 */
#define GPIO_ODATA_ODATA15_Pos                                      (15U)
#define GPIO_ODATA_ODATA15_Msk                                      (0x1UL << GPIO_ODATA_ODATA15_Pos)                              /*!< 0x00008000 */
#define GPIO_ODATA_ODATA15                                          GPIO_ODATA_ODATA15_Msk                                         /*!< Port output data, bit 15 */

