xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define AFIO_REMAP1_TMR2_RMP_Pos                                    (8U)
#define AFIO_REMAP1_TMR2_RMP_Msk                                    (0x3UL << AFIO_REMAP1_TMR2_RMP_Pos)                            /*!< 0x00000300 */
#define AFIO_REMAP1_TMR2_RMP                                        AFIO_REMAP1_TMR2_RMP_Msk                                       /*!< TMR2_RMP[1:0] bits (Timer2 remapping) */
#define AFIO_REMAP1_TMR2_RMP_0                                      (0x1UL << AFIO_REMAP1_TMR2_RMP_Pos)                            /*!< 0x00000100 */
#define AFIO_REMAP1_TMR2_RMP_1                                      (0x2UL << AFIO_REMAP1_TMR2_RMP_Pos)                            /*!< 0x00000200 */

/* TMR2_RMP configuration */
#define AFIO_REMAP1_TMR2_RMP_NOREMAP                                0x00000000U                                                    /*!< No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3) */
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1_Pos                      (8U)
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1_Msk                      (0x1UL << AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1_Pos)              /*!< 0x00000100 */
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1                          AFIO_REMAP1_TMR2_RMP_PARTIALREMAP1_Msk                         /*!< Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3) */
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2_Pos                      (9U)
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2_Msk                      (0x1UL << AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2_Pos)              /*!< 0x00000200 */
#define AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2                          AFIO_REMAP1_TMR2_RMP_PARTIALREMAP2_Msk                         /*!< Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11) */
#define AFIO_REMAP1_TMR2_RMP_FULLREMAP_Pos                          (8U)
#define AFIO_REMAP1_TMR2_RMP_FULLREMAP_Msk                          (0x3UL << AFIO_REMAP1_TMR2_RMP_FULLREMAP_Pos)                  /*!< 0x00000300 */
#define AFIO_REMAP1_TMR2_RMP_FULLREMAP                              AFIO_REMAP1_TMR2_RMP_FULLREMAP_Msk                             /*!< Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11) */

#define AFIO_REMAP1_TMR3_RMP_Pos                                    (10U)
#define AFIO_REMAP1_TMR3_RMP_Msk                                    (0x3UL << AFIO_REMAP1_TMR3_RMP_Pos)                            /*!< 0x00000C00 */
#define AFIO_REMAP1_TMR3_RMP                                        AFIO_REMAP1_TMR3_RMP_Msk                                       /*!< TMR3_RMP[1:0] bits (Timer3 remapping) */
#define AFIO_REMAP1_TMR3_RMP_0                                      (0x1UL << AFIO_REMAP1_TMR3_RMP_Pos)                            /*!< 0x00000400 */
#define AFIO_REMAP1_TMR3_RMP_1                                      (0x2UL << AFIO_REMAP1_TMR3_RMP_Pos)                            /*!< 0x00000800 */

/* TMR3_RMP configuration */
#define AFIO_REMAP1_TMR3_RMP_NOREMAP                                0x00000000U                                                    /*!< No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1) */
#define AFIO_REMAP1_TMR3_RMP_PARTIALREMAP_Pos                       (11U)
#define AFIO_REMAP1_TMR3_RMP_PARTIALREMAP_Msk                       (0x1UL << AFIO_REMAP1_TMR3_RMP_PARTIALREMAP_Pos)               /*!< 0x00000800 */
#define AFIO_REMAP1_TMR3_RMP_PARTIALREMAP                           AFIO_REMAP1_TMR3_RMP_PARTIALREMAP_Msk                          /*!< Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1) */
#define AFIO_REMAP1_TMR3_RMP_FULLREMAP_Pos                          (10U)
#define AFIO_REMAP1_TMR3_RMP_FULLREMAP_Msk                          (0x3UL << AFIO_REMAP1_TMR3_RMP_FULLREMAP_Pos)                  /*!< 0x00000C00 */
#define AFIO_REMAP1_TMR3_RMP_FULLREMAP                              AFIO_REMAP1_TMR3_RMP_FULLREMAP_Msk                             /*!< Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9) */

#define AFIO_REMAP1_TMR4_RMP_Pos                                    (12U)
#define AFIO_REMAP1_TMR4_RMP_Msk                                    (0x1UL << AFIO_REMAP1_TMR4_RMP_Pos)                            /*!< 0x00001000 */
#define AFIO_REMAP1_TMR4_RMP                                        AFIO_REMAP1_TMR4_RMP_Msk                                       /*!< TMR4_RMP bit (Timer4 remapping) */

#define AFIO_REMAP1_CAN1_RMP_Pos                                    (13U)
#define AFIO_REMAP1_CAN1_RMP_Msk                                    (0x3UL << AFIO_REMAP1_CAN1_RMP_Pos)                            /*!< 0x00006000 */
#define AFIO_REMAP1_CAN1_RMP                                        AFIO_REMAP1_CAN1_RMP_Msk                                       /*!< CAN1_RMP[1:0] bits (CAN1 remapping) */
#define AFIO_REMAP1_CAN1_RMP_0                                      (0x1UL << AFIO_REMAP1_CAN1_RMP_Pos)                            /*!< 0x00002000 */
#define AFIO_REMAP1_CAN1_RMP_1                                      (0x2UL << AFIO_REMAP1_CAN1_RMP_Pos)                            /*!< 0x00004000 */

/* CAN1_RMP configuration */
#define AFIO_REMAP1_CAN1_RMP_REMAP1                                 0x00000000U                                                    /*!< CAN1RX mapped to PA11, CAN1TX mapped to PA12 */
#define AFIO_REMAP1_CAN1_RMP_REMAP2_Pos                             (14U)
#define AFIO_REMAP1_CAN1_RMP_REMAP2_Msk                             (0x1UL << AFIO_REMAP1_CAN1_RMP_REMAP2_Pos)                     /*!< 0x00004000 */
#define AFIO_REMAP1_CAN1_RMP_REMAP2                                 AFIO_REMAP1_CAN1_RMP_REMAP2_Msk                                /*!< CAN1RX mapped to PB8, CAN1TX mapped to PB9 */
#define AFIO_REMAP1_CAN1_RMP_REMAP3_Pos                             (13U)
#define AFIO_REMAP1_CAN1_RMP_REMAP3_Msk                             (0x3UL << AFIO_REMAP1_CAN1_RMP_REMAP3_Pos)                     /*!< 0x00006000 */
#define AFIO_REMAP1_CAN1_RMP_REMAP3                                 AFIO_REMAP1_CAN1_RMP_REMAP3_Msk                                /*!< CAN1RX mapped to PD0, CAN1TX mapped to PD1 */

#define AFIO_REMAP1_PD01_RMP_Pos                                    (15U)
#define AFIO_REMAP1_PD01_RMP_Msk                                    (0x1UL << AFIO_REMAP1_PD01_RMP_Pos)                            /*!< 0x00008000 */
#define AFIO_REMAP1_PD01_RMP                                        AFIO_REMAP1_PD01_RMP_Msk                                       /*!< Port D0/Port D1 mapping on OSC_IN/OSC_OUT */
#define AFIO_REMAP1_TMR5CH4_IRMP_Pos                                (16U)
#define AFIO_REMAP1_TMR5CH4_IRMP_Msk                                (0x1UL << AFIO_REMAP1_TMR5CH4_IRMP_Pos)                        /*!< 0x00010000 */
#define AFIO_REMAP1_TMR5CH4_IRMP                                    AFIO_REMAP1_TMR5CH4_IRMP_Msk                                   /*!< TIM5 Channel4 Internal remap */
#define AFIO_REMAP1_ADC1_ETRGINJC_RMP_Pos                           (17U)
#define AFIO_REMAP1_ADC1_ETRGINJC_RMP_Msk                           (0x1UL << AFIO_REMAP1_ADC1_ETRGINJC_RMP_Pos)                   /*!< 0x00020000 */
#define AFIO_REMAP1_ADC1_ETRGINJC_RMP                               AFIO_REMAP1_ADC1_ETRGINJC_RMP_Msk                              /*!< ADC 1 External Trigger Injected Conversion remapping */
#define AFIO_REMAP1_ADC1_ETRGREGC_RMP_Pos                           (18U)
#define AFIO_REMAP1_ADC1_ETRGREGC_RMP_Msk                           (0x1UL << AFIO_REMAP1_ADC1_ETRGREGC_RMP_Pos)                   /*!< 0x00040000 */
#define AFIO_REMAP1_ADC1_ETRGREGC_RMP                               AFIO_REMAP1_ADC1_ETRGREGC_RMP_Msk                              /*!< ADC 1 External Trigger Regular Conversion remapping */
#define AFIO_REMAP1_ADC2_ETRGINJC_RMP_Pos                           (19U)
#define AFIO_REMAP1_ADC2_ETRGINJC_RMP_Msk                           (0x1UL << AFIO_REMAP1_ADC2_ETRGINJC_RMP_Pos)                   /*!< 0x00080000 */
#define AFIO_REMAP1_ADC2_ETRGINJC_RMP                               AFIO_REMAP1_ADC2_ETRGINJC_RMP_Msk                              /*!< ADC 2 External Trigger Injected Conversion remapping */
#define AFIO_REMAP1_ADC2_ETRGREGC_RMP_Pos                           (20U)
#define AFIO_REMAP1_ADC2_ETRGREGC_RMP_Msk                           (0x1UL << AFIO_REMAP1_ADC2_ETRGREGC_RMP_Pos)                   /*!< 0x00100000 */
#define AFIO_REMAP1_ADC2_ETRGREGC_RMP                               AFIO_REMAP1_ADC2_ETRGREGC_RMP_Msk                              /*!< ADC 2 External Trigger Regular Conversion remapping */
#define AFIO_REMAP1_CAN2_RMP_Pos                                    (22U)
#define AFIO_REMAP1_CAN2_RMP_Msk                                    (0x1UL << AFIO_REMAP1_CAN2_RMP_Pos)                            /*!< 0x00400000 */
#define AFIO_REMAP1_CAN2_RMP                                        AFIO_REMAP1_CAN2_RMP_Msk                                       /*!< CAN2RX mapped to PB5, CAN2TX mapped to PB6 */

/* SWJ_CFG configuration */
#define AFIO_REMAP1_SWJ_CFG_Pos                                     (24U)
#define AFIO_REMAP1_SWJ_CFG_Msk                                     (0x7UL << AFIO_REMAP1_SWJ_CFG_Pos)                             /*!< 0x07000000 */
#define AFIO_REMAP1_SWJ_CFG                                         AFIO_REMAP1_SWJ_CFG_Msk                                        /*!< SWJ_CFG[2:0] bits (Serial Wire JTAG configuration) */
#define AFIO_REMAP1_SWJ_CFG_0                                       (0x1UL << AFIO_REMAP1_SWJ_CFG_Pos)                             /*!< 0x01000000 */
#define AFIO_REMAP1_SWJ_CFG_1                                       (0x2UL << AFIO_REMAP1_SWJ_CFG_Pos)                             /*!< 0x02000000 */
#define AFIO_REMAP1_SWJ_CFG_2                                       (0x4UL << AFIO_REMAP1_SWJ_CFG_Pos)                             /*!< 0x04000000 */

#define AFIO_REMAP1_SWJ_CFG_RESET                                   0x00000000U                                                    /*!< Full SWJ (JTAG-DP + SW-DP) : Reset State */
#define AFIO_REMAP1_SWJ_CFG_NOJNTRST_Pos                            (24U)
#define AFIO_REMAP1_SWJ_CFG_NOJNTRST_Msk                            (0x1UL << AFIO_REMAP1_SWJ_CFG_NOJNTRST_Pos)                    /*!< 0x01000000 */
#define AFIO_REMAP1_SWJ_CFG_NOJNTRST                                AFIO_REMAP1_SWJ_CFG_NOJNTRST_Msk                               /*!< Full SWJ (JTAG-DP + SW-DP) but without JNTRST */
#define AFIO_REMAP1_SWJ_CFG_JTAGDISABLE_Pos                         (25U)
#define AFIO_REMAP1_SWJ_CFG_JTAGDISABLE_Msk                         (0x1UL << AFIO_REMAP1_SWJ_CFG_JTAGDISABLE_Pos)                 /*!< 0x02000000 */
#define AFIO_REMAP1_SWJ_CFG_JTAGDISABLE                             AFIO_REMAP1_SWJ_CFG_JTAGDISABLE_Msk                            /*!< JTAG-DP Disabled and SW-DP Enabled */
#define AFIO_REMAP1_SWJ_CFG_DISABLE_Pos                             (26U)
#define AFIO_REMAP1_SWJ_CFG_DISABLE_Msk                             (0x1UL << AFIO_REMAP1_SWJ_CFG_DISABLE_Pos)                     /*!< 0x04000000 */
#define AFIO_REMAP1_SWJ_CFG_DISABLE                                 AFIO_REMAP1_SWJ_CFG_DISABLE_Msk                                /*!< JTAG-DP Disabled and SW-DP Disabled */

