xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/******************  Bit definition for I2C_RISETMAX register  *******************/
#define I2C_RISETMAX_RISETMAX_Pos                                   (0U)
#define I2C_RISETMAX_RISETMAX_Msk                                   (0x3FUL << I2C_RISETMAX_RISETMAX_Pos)                          /*!< 0x0000003F */
#define I2C_RISETMAX_RISETMAX                                       I2C_RISETMAX_RISETMAX_Msk                                      /*!<Maximum Rise Time in Fast/Standard mode (Master mode) */


/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDT_KEY register  ********************/
#define IWDT_KEY_KEY_Pos                                            (0U)
#define IWDT_KEY_KEY_Msk                                            (0xFFFFUL << IWDT_KEY_KEY_Pos)                                 /*!< 0x0000FFFF */
#define IWDT_KEY_KEY                                                IWDT_KEY_KEY_Msk                                               /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDT_PSC register  ********************/
#define IWDT_PSC_PSC_Pos                                            (0U)
#define IWDT_PSC_PSC_Msk                                            (0x7UL << IWDT_PSC_PSC_Pos)                                    /*!< 0x00000007 */
#define IWDT_PSC_PSC                                                IWDT_PSC_PSC_Msk                                               /*!<PR[2:0] (Prescaler divider)         */
#define IWDT_PSC_PSC_0                                              (0x1UL << IWDT_PSC_PSC_Pos)                                    /*!< 0x01 */
#define IWDT_PSC_PSC_1                                              (0x2UL << IWDT_PSC_PSC_Pos)                                    /*!< 0x02 */
#define IWDT_PSC_PSC_2                                              (0x4UL << IWDT_PSC_PSC_Pos)                                    /*!< 0x04 */

/*******************  Bit definition for IWDT_CNTRLD register  *******************/
#define IWDT_CNTRLD_CNTRLD_Pos                                      (0U)
#define IWDT_CNTRLD_CNTRLD_Msk                                      (0xFFFUL << IWDT_CNTRLD_CNTRLD_Pos)                            /*!< 0x00000FFF */
#define IWDT_CNTRLD_CNTRLD                                          IWDT_CNTRLD_CNTRLD_Msk                                         /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDT_STS register  ********************/
#define IWDT_STS_PSCUFLG_Pos                                        (0U)
#define IWDT_STS_PSCUFLG_Msk                                        (0x1UL << IWDT_STS_PSCUFLG_Pos)                                /*!< 0x00000001 */
#define IWDT_STS_PSCUFLG                                            IWDT_STS_PSCUFLG_Msk                                           /*!<Watchdog prescaler value update      */
#define IWDT_STS_CNTUFLG_Pos                                        (1U)
#define IWDT_STS_CNTUFLG_Msk                                        (0x1UL << IWDT_STS_CNTUFLG_Pos)                                /*!< 0x00000002 */
#define IWDT_STS_CNTUFLG                                            IWDT_STS_CNTUFLG_Msk                                           /*!<Watchdog counter reload value update */


/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PMU_CTRL register  ********************/
#define PMU_CTRL_LPDSCFG_Pos                                        (0U)
#define PMU_CTRL_LPDSCFG_Msk                                        (0x1UL << PMU_CTRL_LPDSCFG_Pos)                                /*!< 0x00000001 */
#define PMU_CTRL_LPDSCFG                                            PMU_CTRL_LPDSCFG_Msk                                           /*!< Low-Power Deepsleep                 */
#define PMU_CTRL_PDDSCFG_Pos                                        (1U)
#define PMU_CTRL_PDDSCFG_Msk                                        (0x1UL << PMU_CTRL_PDDSCFG_Pos)                                /*!< 0x00000002 */
#define PMU_CTRL_PDDSCFG                                            PMU_CTRL_PDDSCFG_Msk                                           /*!< Power Down Deepsleep                */
#define PMU_CTRL_WUFLGCLR_Pos                                       (2U)
#define PMU_CTRL_WUFLGCLR_Msk                                       (0x1UL << PMU_CTRL_WUFLGCLR_Pos)                               /*!< 0x00000004 */
#define PMU_CTRL_WUFLGCLR                                           PMU_CTRL_WUFLGCLR_Msk                                          /*!< Clear Wakeup Flag                   */
#define PMU_CTRL_SBFLGCLR_Pos                                       (3U)
#define PMU_CTRL_SBFLGCLR_Msk                                       (0x1UL << PMU_CTRL_SBFLGCLR_Pos)                               /*!< 0x00000008 */
#define PMU_CTRL_SBFLGCLR                                           PMU_CTRL_SBFLGCLR_Msk                                          /*!< Clear Standby Flag                  */
#define PMU_CTRL_PVDEN_Pos                                          (4U)
#define PMU_CTRL_PVDEN_Msk                                          (0x1UL << PMU_CTRL_PVDEN_Pos)                                  /*!< 0x00000010 */
#define PMU_CTRL_PVDEN                                              PMU_CTRL_PVDEN_Msk                                             /*!< Power Voltage Detector Enable       */

