xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define PMU_CTRL_PLSEL_Pos                                          (5U)
#define PMU_CTRL_PLSEL_Msk                                          (0x7UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x000000E0 */
#define PMU_CTRL_PLSEL                                              PMU_CTRL_PLSEL_Msk                                             /*!< PLS[2:0] bits (PVD Level Selection) */
#define PMU_CTRL_PLSEL_0                                            (0x1UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000020 */
#define PMU_CTRL_PLSEL_1                                            (0x2UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000040 */
#define PMU_CTRL_PLSEL_2                                            (0x4UL << PMU_CTRL_PLSEL_Pos)                                  /*!< 0x00000080 */

/*!< PVD level configuration */
#define PMU_CTRL_PLSEL_LEV0                                         0x00000000U                                                    /*!< PVD level 0 */
#define PMU_CTRL_PLSEL_LEV1                                         0x00000020U                                                    /*!< PVD level 1 */
#define PMU_CTRL_PLSEL_LEV2                                         0x00000040U                                                    /*!< PVD level 2 */
#define PMU_CTRL_PLSEL_LEV3                                         0x00000060U                                                    /*!< PVD level 3 */
#define PMU_CTRL_PLSEL_LEV4                                         0x00000080U                                                    /*!< PVD level 4 */
#define PMU_CTRL_PLSEL_LEV5                                         0x000000A0U                                                    /*!< PVD level 5 */
#define PMU_CTRL_PLSEL_LEV6                                         0x000000C0U                                                    /*!< PVD level 6 */
#define PMU_CTRL_PLSEL_LEV7                                         0x000000E0U                                                    /*!< PVD level 7 */
#define PMU_CTRL_BPWEN_Pos                                          (8U)
#define PMU_CTRL_BPWEN_Msk                                          (0x1UL << PMU_CTRL_BPWEN_Pos)                                  /*!< 0x00000100 */
#define PMU_CTRL_BPWEN                                              PMU_CTRL_BPWEN_Msk                                             /*!< Disable Backup Domain write protection                     */

/*******************  Bit definition for PMU_CSTS register  ********************/
#define PMU_CSTS_WUEFLG_Pos                                         (0U)
#define PMU_CSTS_WUEFLG_Msk                                         (0x1UL << PMU_CSTS_WUEFLG_Pos)                                 /*!< 0x00000001 */
#define PMU_CSTS_WUEFLG                                             PMU_CSTS_WUEFLG_Msk                                            /*!< Wakeup Flag                                      */
#define PMU_CSTS_SBFLG_Pos                                          (1U)
#define PMU_CSTS_SBFLG_Msk                                          (0x1UL << PMU_CSTS_SBFLG_Pos)                                  /*!< 0x00000002 */
#define PMU_CSTS_SBFLG                                              PMU_CSTS_SBFLG_Msk                                             /*!< Standby Flag                                     */
#define PMU_CSTS_PVDOFLG_Pos                                        (2U)
#define PMU_CSTS_PVDOFLG_Msk                                        (0x1UL << PMU_CSTS_PVDOFLG_Pos)                                /*!< 0x00000004 */
#define PMU_CSTS_PVDOFLG                                            PMU_CSTS_PVDOFLG_Msk                                           /*!< PVD Output                                       */
#define PMU_CSTS_WKUPCFG_Pos                                        (8U)
#define PMU_CSTS_WKUPCFG_Msk                                        (0x1UL << PMU_CSTS_WKUPCFG_Pos)                                /*!< 0x00000100 */
#define PMU_CSTS_WKUPCFG                                            PMU_CSTS_WKUPCFG_Msk                                           /*!< Enable WKUP pin                                  */

/******************************************************************************/
/*                                                                            */
/*                              Backup Registers                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for BAKPR_DATA1 register  *******************/
#define BAKPR_DATA1_DATA_Pos                                        (0U)
#define BAKPR_DATA1_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA1_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA1_DATA                                            BAKPR_DATA1_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA2 register  *******************/
#define BAKPR_DATA2_DATA_Pos                                        (0U)
#define BAKPR_DATA2_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA2_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA2_DATA                                            BAKPR_DATA2_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA3 register  *******************/
#define BAKPR_DATA3_DATA_Pos                                        (0U)
#define BAKPR_DATA3_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA3_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA3_DATA                                            BAKPR_DATA3_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA4 register  *******************/
#define BAKPR_DATA4_DATA_Pos                                        (0U)
#define BAKPR_DATA4_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA4_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA4_DATA                                            BAKPR_DATA4_DATA_Msk                                           /*!< Backup data */

