xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bit definition for BAKPR_DATA5 register  *******************/
#define BAKPR_DATA5_DATA_Pos                                        (0U)
#define BAKPR_DATA5_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA5_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA5_DATA                                            BAKPR_DATA5_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA6 register  *******************/
#define BAKPR_DATA6_DATA_Pos                                        (0U)
#define BAKPR_DATA6_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA6_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA6_DATA                                            BAKPR_DATA6_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA7 register  *******************/
#define BAKPR_DATA7_DATA_Pos                                        (0U)
#define BAKPR_DATA7_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA7_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA7_DATA                                            BAKPR_DATA7_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA8 register  *******************/
#define BAKPR_DATA8_DATA_Pos                                        (0U)
#define BAKPR_DATA8_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA8_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA8_DATA                                            BAKPR_DATA8_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA9 register  *******************/
#define BAKPR_DATA9_DATA_Pos                                        (0U)
#define BAKPR_DATA9_DATA_Msk                                        (0xFFFFUL << BAKPR_DATA9_DATA_Pos)                             /*!< 0x0000FFFF */
#define BAKPR_DATA9_DATA                                            BAKPR_DATA9_DATA_Msk                                           /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA10 register  *******************/
#define BAKPR_DATA10_DATA_Pos                                       (0U)
#define BAKPR_DATA10_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA10_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA10_DATA                                           BAKPR_DATA10_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA11 register  *******************/
#define BAKPR_DATA11_DATA_Pos                                       (0U)
#define BAKPR_DATA11_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA11_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA11_DATA                                           BAKPR_DATA11_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA12 register  *******************/
#define BAKPR_DATA12_DATA_Pos                                       (0U)
#define BAKPR_DATA12_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA12_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA12_DATA                                           BAKPR_DATA12_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA13 register  *******************/
#define BAKPR_DATA13_DATA_Pos                                       (0U)
#define BAKPR_DATA13_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA13_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA13_DATA                                           BAKPR_DATA13_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA14 register  *******************/
#define BAKPR_DATA14_DATA_Pos                                       (0U)
#define BAKPR_DATA14_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA14_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA14_DATA                                           BAKPR_DATA14_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA15 register  *******************/
#define BAKPR_DATA15_DATA_Pos                                       (0U)
#define BAKPR_DATA15_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA15_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA15_DATA                                           BAKPR_DATA15_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA16 register  *******************/
#define BAKPR_DATA16_DATA_Pos                                       (0U)
#define BAKPR_DATA16_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA16_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA16_DATA                                           BAKPR_DATA16_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA17 register  *******************/
#define BAKPR_DATA17_DATA_Pos                                       (0U)
#define BAKPR_DATA17_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA17_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA17_DATA                                           BAKPR_DATA17_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA18 register  *******************/
#define BAKPR_DATA18_DATA_Pos                                       (0U)
#define BAKPR_DATA18_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA18_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA18_DATA                                           BAKPR_DATA18_DATA_Msk                                          /*!< Backup data */

