xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bit definition for BAKPR_DATA19 register  *******************/
#define BAKPR_DATA19_DATA_Pos                                       (0U)
#define BAKPR_DATA19_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA19_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA19_DATA                                           BAKPR_DATA19_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA20 register  *******************/
#define BAKPR_DATA20_DATA_Pos                                       (0U)
#define BAKPR_DATA20_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA20_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA20_DATA                                           BAKPR_DATA20_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA21 register  *******************/
#define BAKPR_DATA21_DATA_Pos                                       (0U)
#define BAKPR_DATA21_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA21_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA21_DATA                                           BAKPR_DATA21_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA22 register  *******************/
#define BAKPR_DATA22_DATA_Pos                                       (0U)
#define BAKPR_DATA22_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA22_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA22_DATA                                           BAKPR_DATA22_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA23 register  *******************/
#define BAKPR_DATA23_DATA_Pos                                       (0U)
#define BAKPR_DATA23_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA23_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA23_DATA                                           BAKPR_DATA23_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA24 register  *******************/
#define BAKPR_DATA24_DATA_Pos                                       (0U)
#define BAKPR_DATA24_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA24_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA24_DATA                                           BAKPR_DATA24_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA25 register  *******************/
#define BAKPR_DATA25_DATA_Pos                                       (0U)
#define BAKPR_DATA25_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA25_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA25_DATA                                           BAKPR_DATA25_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA26 register  *******************/
#define BAKPR_DATA26_DATA_Pos                                       (0U)
#define BAKPR_DATA26_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA26_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA26_DATA                                           BAKPR_DATA26_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA27 register  *******************/
#define BAKPR_DATA27_DATA_Pos                                       (0U)
#define BAKPR_DATA27_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA27_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA27_DATA                                           BAKPR_DATA27_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA28 register  *******************/
#define BAKPR_DATA28_DATA_Pos                                       (0U)
#define BAKPR_DATA28_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA28_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA28_DATA                                           BAKPR_DATA28_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA29 register  *******************/
#define BAKPR_DATA29_DATA_Pos                                       (0U)
#define BAKPR_DATA29_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA29_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA29_DATA                                           BAKPR_DATA29_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA30 register  *******************/
#define BAKPR_DATA30_DATA_Pos                                       (0U)
#define BAKPR_DATA30_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA30_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA30_DATA                                           BAKPR_DATA30_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA31 register  *******************/
#define BAKPR_DATA31_DATA_Pos                                       (0U)
#define BAKPR_DATA31_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA31_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA31_DATA                                           BAKPR_DATA31_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA32 register  *******************/
#define BAKPR_DATA32_DATA_Pos                                       (0U)
#define BAKPR_DATA32_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA32_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA32_DATA                                           BAKPR_DATA32_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA33 register  *******************/
#define BAKPR_DATA33_DATA_Pos                                       (0U)
#define BAKPR_DATA33_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA33_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA33_DATA                                           BAKPR_DATA33_DATA_Msk                                          /*!< Backup data */

/*******************  Bit definition for BAKPR_DATA34 register  *******************/
#define BAKPR_DATA34_DATA_Pos                                       (0U)
#define BAKPR_DATA34_DATA_Msk                                       (0xFFFFUL << BAKPR_DATA34_DATA_Pos)                            /*!< 0x0000FFFF */
#define BAKPR_DATA34_DATA                                           BAKPR_DATA34_DATA_Msk                                          /*!< Backup data */

