xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define RCM_CFG_OTGFSPSC_Pos                                        (22U)
#define RCM_CFG_OTGFSPSC_Msk                                        (0x3UL << RCM_CFG_OTGFSPSC_Pos)                                /*!< 0x00C00000 */
#define RCM_CFG_OTGFSPSC                                            RCM_CFG_OTGFSPSC_Msk                                           /*!< OTGFSPSC[1:0] bits (USB OTG FS prescaler) */
#define RCM_CFG_OTGFSPSC_0                                          (0x1UL << RCM_CFG_OTGFSPSC_Pos)                                /*!< 0x00400000 */
#define RCM_CFG_OTGFSPSC_1                                          (0x2UL << RCM_CFG_OTGFSPSC_Pos)                                /*!< 0x00800000 */

#define RCM_CFG_OTGFSPSC_DIV_1_5                                    0x00000000U                                                    /*!< PLL clock divided by 1.5 */

/*!< MCOSEL configuration */
#define RCM_CFG_MCOSEL_Pos                                          (24U)
#define RCM_CFG_MCOSEL_Msk                                          (0x7UL << RCM_CFG_MCOSEL_Pos)                                  /*!< 0x07000000 */
#define RCM_CFG_MCOSEL                                              RCM_CFG_MCOSEL_Msk                                             /*!< MCOSEL[2:0] bits (Microcontroller Clock Output) */
#define RCM_CFG_MCOSEL_0                                            (0x1UL << RCM_CFG_MCOSEL_Pos)                                  /*!< 0x01000000 */
#define RCM_CFG_MCOSEL_1                                            (0x2UL << RCM_CFG_MCOSEL_Pos)                                  /*!< 0x02000000 */
#define RCM_CFG_MCOSEL_2                                            (0x4UL << RCM_CFG_MCOSEL_Pos)                                  /*!< 0x04000000 */

#define RCM_CFG_MCOSEL_NOCLOCK                                      0x00000000U                                                    /*!< No clock */
#define RCM_CFG_MCOSEL_SYSCLK                                       0x04000000U                                                    /*!< System clock selected */
#define RCM_CFG_MCOSEL_HSI                                          0x05000000U                                                    /*!< HSI oscillator clock selected */
#define RCM_CFG_MCOSEL_HSE                                          0x06000000U                                                    /*!< HSE oscillator clock selected */
#define RCM_CFG_MCOSEL_PLLCLK_DIV2                                  0x07000000U                                                    /*!< PLL clock divided by 2 */

/********************  Bit definition for RCM_INT register  *******************/
#define RCM_INT_LSIRDYFLG_Pos                                       (0U)
#define RCM_INT_LSIRDYFLG_Msk                                       (0x1UL << RCM_INT_LSIRDYFLG_Pos)                               /*!< 0x00000001 */
#define RCM_INT_LSIRDYFLG                                           RCM_INT_LSIRDYFLG_Msk
#define RCM_INT_LSERDYFLG_Pos                                       (1U)
#define RCM_INT_LSERDYFLG_Msk                                       (0x1UL << RCM_INT_LSERDYFLG_Pos)                               /*!< 0x00000002 */
#define RCM_INT_LSERDYFLG                                           RCM_INT_LSERDYFLG_Msk
#define RCM_INT_HSIRDYFLG_Pos                                       (2U)
#define RCM_INT_HSIRDYFLG_Msk                                       (0x1UL << RCM_INT_HSIRDYFLG_Pos)                               /*!< 0x00000004 */
#define RCM_INT_HSIRDYFLG                                           RCM_INT_HSIRDYFLG_Msk
#define RCM_INT_HSERDYFLG_Pos                                       (3U)
#define RCM_INT_HSERDYFLG_Msk                                       (0x1UL << RCM_INT_HSERDYFLG_Pos)                               /*!< 0x00000008 */
#define RCM_INT_HSERDYFLG                                           RCM_INT_HSERDYFLG_Msk
#define RCM_INT_PLL1RDYFLG_Pos                                      (4U)
#define RCM_INT_PLL1RDYFLG_Msk                                      (0x1UL << RCM_INT_PLL1RDYFLG_Pos)                              /*!< 0x00000010 */
#define RCM_INT_PLL1RDYFLG                                          RCM_INT_PLL1RDYFLG_Msk

#define RCM_INT_CSSFLG_Pos                                          (7U)
#define RCM_INT_CSSFLG_Msk                                          (0x1UL << RCM_INT_CSSFLG_Pos)                                  /*!< 0x00000080 */
#define RCM_INT_CSSFLG                                              RCM_INT_CSSFLG_Msk
#define RCM_INT_LSIRDYEN_Pos                                        (8U)
#define RCM_INT_LSIRDYEN_Msk                                        (0x1UL << RCM_INT_LSIRDYEN_Pos)                                /*!< 0x00000100 */
#define RCM_INT_LSIRDYEN                                            RCM_INT_LSIRDYEN_Msk
#define RCM_INT_LSERDYEN_Pos                                        (9U)
#define RCM_INT_LSERDYEN_Msk                                        (0x1UL << RCM_INT_LSERDYEN_Pos)                                /*!< 0x00000200 */
#define RCM_INT_LSERDYEN                                            RCM_INT_LSERDYEN_Msk
#define RCM_INT_HSIRDYEN_Pos                                        (10U)
#define RCM_INT_HSIRDYEN_Msk                                        (0x1UL << RCM_INT_HSIRDYEN_Pos)                                /*!< 0x00000400 */
#define RCM_INT_HSIRDYEN                                            RCM_INT_HSIRDYEN_Msk
#define RCM_INT_HSERDYEN_Pos                                        (11U)
#define RCM_INT_HSERDYEN_Msk                                        (0x1UL << RCM_INT_HSERDYEN_Pos)                                /*!< 0x00000800 */
#define RCM_INT_HSERDYEN                                            RCM_INT_HSERDYEN_Msk
#define RCM_INT_PLL1RDYEN_Pos                                       (12U)
#define RCM_INT_PLL1RDYEN_Msk                                       (0x1UL << RCM_INT_PLL1RDYEN_Pos)                               /*!< 0x00001000 */
#define RCM_INT_PLL1RDYEN                                           RCM_INT_PLL1RDYEN_Msk

