xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
#define RCM_INT_LSIRDYCLR_Pos                                       (16U)
#define RCM_INT_LSIRDYCLR_Msk                                       (0x1UL << RCM_INT_LSIRDYCLR_Pos)                               /*!< 0x00010000 */
#define RCM_INT_LSIRDYCLR                                           RCM_INT_LSIRDYCLR_Msk
#define RCM_INT_LSERDYCLR_Pos                                       (17U)
#define RCM_INT_LSERDYCLR_Msk                                       (0x1UL << RCM_INT_LSERDYCLR_Pos)                               /*!< 0x00020000 */
#define RCM_INT_LSERDYCLR                                           RCM_INT_LSERDYCLR_Msk
#define RCM_INT_HSIRDYCLR_Pos                                       (18U)
#define RCM_INT_HSIRDYCLR_Msk                                       (0x1UL << RCM_INT_HSIRDYCLR_Pos)                               /*!< 0x00040000 */
#define RCM_INT_HSIRDYCLR                                           RCM_INT_HSIRDYCLR_Msk
#define RCM_INT_HSERDYCLR_Pos                                       (19U)
#define RCM_INT_HSERDYCLR_Msk                                       (0x1UL << RCM_INT_HSERDYCLR_Pos)                               /*!< 0x00080000 */
#define RCM_INT_HSERDYCLR                                           RCM_INT_HSERDYCLR_Msk
#define RCM_INT_PLL1RDYCLR_Pos                                      (20U)
#define RCM_INT_PLL1RDYCLR_Msk                                      (0x1UL << RCM_INT_PLL1RDYCLR_Pos)                              /*!< 0x00100000 */
#define RCM_INT_PLL1RDYCLR                                          RCM_INT_PLL1RDYCLR_Msk

#define RCM_INT_CSSCLR_Pos                                          (23U)
#define RCM_INT_CSSCLR_Msk                                          (0x1UL << RCM_INT_CSSCLR_Pos)                                  /*!< 0x00800000 */
#define RCM_INT_CSSCLR                                              RCM_INT_CSSCLR_Msk

/*******************  Bit definition for RCM_AHB1RST register  ******************/
#define RCM_AHB1RST_OTGFSRST_Pos                                    (9U)
#define RCM_AHB1RST_OTGFSRST_Msk                                    (0x1UL << RCM_AHB1RST_OTGFSRST_Pos)                            /*!< 0x00000200 */
#define RCM_AHB1RST_OTGFSRST                                        RCM_AHB1RST_OTGFSRST_Msk                                       /*!< USB OTG FS reset */

/*******************  Bit definition for RCM_APB2RST register  ******************/
#define RCM_APB2RST_AFIORST_Pos                                     (0U)
#define RCM_APB2RST_AFIORST_Msk                                     (0x1UL << RCM_APB2RST_AFIORST_Pos)                             /*!< 0x00000001 */
#define RCM_APB2RST_AFIORST                                         RCM_APB2RST_AFIORST_Msk                                        /*!< Alternate Function I/O reset */
#define RCM_APB2RST_PARST_Pos                                       (2U)
#define RCM_APB2RST_PARST_Msk                                       (0x1UL << RCM_APB2RST_PARST_Pos)                               /*!< 0x00000004 */
#define RCM_APB2RST_PARST                                           RCM_APB2RST_PARST_Msk                                          /*!< I/O port A reset */
#define RCM_APB2RST_PBRST_Pos                                       (3U)
#define RCM_APB2RST_PBRST_Msk                                       (0x1UL << RCM_APB2RST_PBRST_Pos)                               /*!< 0x00000008 */
#define RCM_APB2RST_PBRST                                           RCM_APB2RST_PBRST_Msk                                          /*!< I/O port B reset */
#define RCM_APB2RST_PCRST_Pos                                       (4U)
#define RCM_APB2RST_PCRST_Msk                                       (0x1UL << RCM_APB2RST_PCRST_Pos)                               /*!< 0x00000010 */
#define RCM_APB2RST_PCRST                                           RCM_APB2RST_PCRST_Msk                                          /*!< I/O port C reset */
#define RCM_APB2RST_PDRST_Pos                                       (5U)
#define RCM_APB2RST_PDRST_Msk                                       (0x1UL << RCM_APB2RST_PDRST_Pos)                               /*!< 0x00000020 */
#define RCM_APB2RST_PDRST                                           RCM_APB2RST_PDRST_Msk                                          /*!< I/O port D reset */
#define RCM_APB2RST_ADC1RST_Pos                                     (9U)
#define RCM_APB2RST_ADC1RST_Msk                                     (0x1UL << RCM_APB2RST_ADC1RST_Pos)                             /*!< 0x00000200 */
#define RCM_APB2RST_ADC1RST                                         RCM_APB2RST_ADC1RST_Msk                                        /*!< ADC 1 interface reset */
#define RCM_APB2RST_ADC2RST_Pos                                     (10U)
#define RCM_APB2RST_ADC2RST_Msk                                     (0x1UL << RCM_APB2RST_ADC2RST_Pos)                             /*!< 0x00000400 */
#define RCM_APB2RST_ADC2RST                                         RCM_APB2RST_ADC2RST_Msk                                        /*!< ADC 2 interface reset */
#define RCM_APB2RST_TMR1RST_Pos                                     (11U)
#define RCM_APB2RST_TMR1RST_Msk                                     (0x1UL << RCM_APB2RST_TMR1RST_Pos)                             /*!< 0x00000800 */
#define RCM_APB2RST_TMR1RST                                         RCM_APB2RST_TMR1RST_Msk                                        /*!< Timer 1 reset */
#define RCM_APB2RST_SPI1RST_Pos                                     (12U)
#define RCM_APB2RST_SPI1RST_Msk                                     (0x1UL << RCM_APB2RST_SPI1RST_Pos)                             /*!< 0x00001000 */
#define RCM_APB2RST_SPI1RST                                         RCM_APB2RST_SPI1RST_Msk                                        /*!< SPI 1 reset */
#define RCM_APB2RST_TMR8RST_Pos                                     (13U)
#define RCM_APB2RST_TMR8RST_Msk                                     (0x1UL << RCM_APB2RST_TMR8RST_Pos)                             /*!< 0x00002000 */
#define RCM_APB2RST_TMR8RST                                         RCM_APB2RST_TMR8RST_Msk                                        /*!< Timer 8 reset */
#define RCM_APB2RST_USART1RST_Pos                                   (14U)
#define RCM_APB2RST_USART1RST_Msk                                   (0x1UL << RCM_APB2RST_USART1RST_Pos)                           /*!< 0x00004000 */
#define RCM_APB2RST_USART1RST                                       RCM_APB2RST_USART1RST_Msk                                      /*!< USART 1 reset */

/*******************  Bit definition for RCM_APB1RST register  ******************/
#define RCM_APB1RST_TMR2RST_Pos                                     (0U)
#define RCM_APB1RST_TMR2RST_Msk                                     (0x1UL << RCM_APB1RST_TMR2RST_Pos)                             /*!< 0x00000001 */
#define RCM_APB1RST_TMR2RST                                         RCM_APB1RST_TMR2RST_Msk                                        /*!< Timer 2 reset */
#define RCM_APB1RST_TMR3RST_Pos                                     (1U)
#define RCM_APB1RST_TMR3RST_Msk                                     (0x1UL << RCM_APB1RST_TMR3RST_Pos)                             /*!< 0x00000002 */
#define RCM_APB1RST_TMR3RST                                         RCM_APB1RST_TMR3RST_Msk                                        /*!< Timer 3 reset */
#define RCM_APB1RST_TMR4RST_Pos                                     (2U)
#define RCM_APB1RST_TMR4RST_Msk                                     (0x1UL << RCM_APB1RST_TMR4RST_Pos)                             /*!< 0x00000004 */
#define RCM_APB1RST_TMR4RST                                         RCM_APB1RST_TMR4RST_Msk                                        /*!< Timer 4 reset */
#define RCM_APB1RST_TMR5RST_Pos                                     (3U)
#define RCM_APB1RST_TMR5RST_Msk                                     (0x1UL << RCM_APB1RST_TMR5RST_Pos)                             /*!< 0x00000008 */
#define RCM_APB1RST_TMR5RST                                         RCM_APB1RST_TMR5RST_Msk                                        /*!< Timer 5 reset */
#define RCM_APB1RST_WWDTRST_Pos                                     (11U)
#define RCM_APB1RST_WWDTRST_Msk                                     (0x1UL << RCM_APB1RST_WWDTRST_Pos)                             /*!< 0x00000800 */
#define RCM_APB1RST_WWDTRST                                         RCM_APB1RST_WWDTRST_Msk                                        /*!< Window Watchdog reset */
#define RCM_APB1RST_SPI2RST_Pos                                     (14U)
#define RCM_APB1RST_SPI2RST_Msk                                     (0x1UL << RCM_APB1RST_SPI2RST_Pos)                             /*!< 0x00004000 */
#define RCM_APB1RST_SPI2RST                                         RCM_APB1RST_SPI2RST_Msk                                        /*!< SPI 2 reset */
#define RCM_APB1RST_USART2RST_Pos                                   (17U)
#define RCM_APB1RST_USART2RST_Msk                                   (0x1UL << RCM_APB1RST_USART2RST_Pos)                           /*!< 0x00020000 */
#define RCM_APB1RST_USART2RST                                       RCM_APB1RST_USART2RST_Msk                                      /*!< USART 2 reset */
#define RCM_APB1RST_USART3RST_Pos                                   (18U)
#define RCM_APB1RST_USART3RST_Msk                                   (0x1UL << RCM_APB1RST_USART3RST_Pos)                           /*!< 0x00040000 */
#define RCM_APB1RST_USART3RST                                       RCM_APB1RST_USART3RST_Msk                                      /*!< USART 3 reset */
#define RCM_APB1RST_UART4RST_Pos                                    (19U)
#define RCM_APB1RST_UART4RST_Msk                                    (0x1UL << RCM_APB1RST_UART4RST_Pos)                            /*!< 0x00080000 */
#define RCM_APB1RST_UART4RST                                        RCM_APB1RST_UART4RST_Msk                                       /*!< UART 4 reset */
#define RCM_APB1RST_I2C1RST_Pos                                     (21U)
#define RCM_APB1RST_I2C1RST_Msk                                     (0x1UL << RCM_APB1RST_I2C1RST_Pos)                             /*!< 0x00200000 */
#define RCM_APB1RST_I2C1RST                                         RCM_APB1RST_I2C1RST_Msk                                        /*!< I2C 1 reset */
#define RCM_APB1RST_CAN1RST_Pos                                     (25U)
#define RCM_APB1RST_CAN1RST_Msk                                     (0x1UL << RCM_APB1RST_CAN1RST_Pos)                             /*!< 0x02000000 */
#define RCM_APB1RST_CAN1RST                                         RCM_APB1RST_CAN1RST_Msk                                        /*!< CAN1 reset */
#define RCM_APB1RST_CAN2RST_Pos                                     (26U)
#define RCM_APB1RST_CAN2RST_Msk                                     (0x1UL << RCM_APB1RST_CAN2RST_Pos)                             /*!< 0x04000000 */
#define RCM_APB1RST_CAN2RST                                         RCM_APB1RST_CAN2RST_Msk                                        /*!< CAN2 reset */
#define RCM_APB1RST_BAKPRST_Pos                                     (27U)
#define RCM_APB1RST_BAKPRST_Msk                                     (0x1UL << RCM_APB1RST_BAKPRST_Pos)                             /*!< 0x08000000 */
#define RCM_APB1RST_BAKPRST                                         RCM_APB1RST_BAKPRST_Msk                                        /*!< Backup interface reset */
#define RCM_APB1RST_PMURST_Pos                                      (28U)
#define RCM_APB1RST_PMURST_Msk                                      (0x1UL << RCM_APB1RST_PMURST_Pos)                              /*!< 0x10000000 */
#define RCM_APB1RST_PMURST                                          RCM_APB1RST_PMURST_Msk                                         /*!< Power interface reset */

/********************  Bit definition for RCM_AHB1CLKEN register  ***************/
#define RCM_AHB1CLKEN_DMA1EN_Pos                                    (0U)
#define RCM_AHB1CLKEN_DMA1EN_Msk                                    (0x1UL << RCM_AHB1CLKEN_DMA1EN_Pos)                            /*!< 0x00000001 */
#define RCM_AHB1CLKEN_DMA1EN                                        RCM_AHB1CLKEN_DMA1EN_Msk                                       /*!< DMA1 clock enable */
#define RCM_AHB1CLKEN_DMA2EN_Pos                                    (1U)
#define RCM_AHB1CLKEN_DMA2EN_Msk                                    (0x1UL << RCM_AHB1CLKEN_DMA2EN_Pos)                            /*!< 0x00000002 */
#define RCM_AHB1CLKEN_DMA2EN                                        RCM_AHB1CLKEN_DMA2EN_Msk                                       /*!< DMA2 clock enable */
#define RCM_AHB1CLKEN_SRAMEN_Pos                                    (2U)
#define RCM_AHB1CLKEN_SRAMEN_Msk                                    (0x1UL << RCM_AHB1CLKEN_SRAMEN_Pos)                            /*!< 0x00000004 */
#define RCM_AHB1CLKEN_SRAMEN                                        RCM_AHB1CLKEN_SRAMEN_Msk                                       /*!< SRAM interface clock enable */
#define RCM_AHB1CLKEN_FMCEN_Pos                                     (4U)
#define RCM_AHB1CLKEN_FMCEN_Msk                                     (0x1UL << RCM_AHB1CLKEN_FMCEN_Pos)                             /*!< 0x00000010 */
#define RCM_AHB1CLKEN_FMCEN                                         RCM_AHB1CLKEN_FMCEN_Msk                                        /*!< FMC clock enable */
#define RCM_AHB1CLKEN_CRCEN_Pos                                     (6U)
#define RCM_AHB1CLKEN_CRCEN_Msk                                     (0x1UL << RCM_AHB1CLKEN_CRCEN_Pos)                             /*!< 0x00000040 */
#define RCM_AHB1CLKEN_CRCEN                                         RCM_AHB1CLKEN_CRCEN_Msk                                        /*!< CRC clock enable */
#define RCM_AHB1CLKEN_OTGFSEN_Pos                                   (9U)
#define RCM_AHB1CLKEN_OTGFSEN_Msk                                   (0x1UL << RCM_AHB1CLKEN_OTGFSEN_Pos)                           /*!< 0x00000200 */
#define RCM_AHB1CLKEN_OTGFSEN                                       RCM_AHB1CLKEN_OTGFSEN_Msk                                      /*!< OTG FS clock enable */

/********************  Bit definition for RCM_APB2CLKEN register  ***************/
#define RCM_APB2CLKEN_AFIOEN_Pos                                    (0U)
#define RCM_APB2CLKEN_AFIOEN_Msk                                    (0x1UL << RCM_APB2CLKEN_AFIOEN_Pos)                            /*!< 0x00000001 */
#define RCM_APB2CLKEN_AFIOEN                                        RCM_APB2CLKEN_AFIOEN_Msk                                       /*!< Alternate Function I/O clock enable */
#define RCM_APB2CLKEN_PAEN_Pos                                      (2U)
#define RCM_APB2CLKEN_PAEN_Msk                                      (0x1UL << RCM_APB2CLKEN_PAEN_Pos)                              /*!< 0x00000004 */
#define RCM_APB2CLKEN_PAEN                                          RCM_APB2CLKEN_PAEN_Msk                                         /*!< I/O port A clock enable */
#define RCM_APB2CLKEN_PBEN_Pos                                      (3U)
#define RCM_APB2CLKEN_PBEN_Msk                                      (0x1UL << RCM_APB2CLKEN_PBEN_Pos)                              /*!< 0x00000008 */
#define RCM_APB2CLKEN_PBEN                                          RCM_APB2CLKEN_PBEN_Msk                                         /*!< I/O port B clock enable */
#define RCM_APB2CLKEN_PCEN_Pos                                      (4U)
#define RCM_APB2CLKEN_PCEN_Msk                                      (0x1UL << RCM_APB2CLKEN_PCEN_Pos)                              /*!< 0x00000010 */
#define RCM_APB2CLKEN_PCEN                                          RCM_APB2CLKEN_PCEN_Msk                                         /*!< I/O port C clock enable */
#define RCM_APB2CLKEN_PDEN_Pos                                      (5U)
#define RCM_APB2CLKEN_PDEN_Msk                                      (0x1UL << RCM_APB2CLKEN_PDEN_Pos)                              /*!< 0x00000020 */
#define RCM_APB2CLKEN_PDEN                                          RCM_APB2CLKEN_PDEN_Msk                                         /*!< I/O port D clock enable */
#define RCM_APB2CLKEN_ADC1EN_Pos                                    (9U)
#define RCM_APB2CLKEN_ADC1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_ADC1EN_Pos)                            /*!< 0x00000200 */
#define RCM_APB2CLKEN_ADC1EN                                        RCM_APB2CLKEN_ADC1EN_Msk                                       /*!< ADC 1 interface clock enable */
#define RCM_APB2CLKEN_ADC2EN_Pos                                    (10U)
#define RCM_APB2CLKEN_ADC2EN_Msk                                    (0x1UL << RCM_APB2CLKEN_ADC2EN_Pos)                            /*!< 0x00000400 */
#define RCM_APB2CLKEN_ADC2EN                                        RCM_APB2CLKEN_ADC2EN_Msk                                       /*!< ADC 2 interface clock enable */
#define RCM_APB2CLKEN_TMR1EN_Pos                                    (11U)
#define RCM_APB2CLKEN_TMR1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_TMR1EN_Pos)                            /*!< 0x00000800 */
#define RCM_APB2CLKEN_TMR1EN                                        RCM_APB2CLKEN_TMR1EN_Msk                                       /*!< Timer 1 clock enable */
#define RCM_APB2CLKEN_SPI1EN_Pos                                    (12U)
#define RCM_APB2CLKEN_SPI1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_SPI1EN_Pos)                            /*!< 0x00001000 */
#define RCM_APB2CLKEN_SPI1EN                                        RCM_APB2CLKEN_SPI1EN_Msk                                       /*!< SPI 1 clock enable */
#define RCM_APB2CLKEN_TMR8EN_Pos                                    (13U)
#define RCM_APB2CLKEN_TMR8EN_Msk                                    (0x1UL << RCM_APB2CLKEN_TMR8EN_Pos)                            /*!< 0x00002000 */
#define RCM_APB2CLKEN_TMR8EN                                        RCM_APB2CLKEN_TMR8EN_Msk                                       /*!< Timer 8 clock enable */
#define RCM_APB2CLKEN_USART1EN_Pos                                  (14U)
#define RCM_APB2CLKEN_USART1EN_Msk                                  (0x1UL << RCM_APB2CLKEN_USART1EN_Pos)                          /*!< 0x00004000 */
#define RCM_APB2CLKEN_USART1EN                                      RCM_APB2CLKEN_USART1EN_Msk                                     /*!< USART 1 clock enable */

