xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/********************  Bit definition for RCM_APB1CLKEN register  ***************/
#define RCM_APB1CLKEN_TMR2EN_Pos                                    (0U)
#define RCM_APB1CLKEN_TMR2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR2EN_Pos)                            /*!< 0x00000001 */
#define RCM_APB1CLKEN_TMR2EN                                        RCM_APB1CLKEN_TMR2EN_Msk                                       /*!< Timer 2 clock enable */
#define RCM_APB1CLKEN_TMR3EN_Pos                                    (1U)
#define RCM_APB1CLKEN_TMR3EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR3EN_Pos)                            /*!< 0x00000002 */
#define RCM_APB1CLKEN_TMR3EN                                        RCM_APB1CLKEN_TMR3EN_Msk                                       /*!< Timer 3 clock enable */
#define RCM_APB1CLKEN_TMR4EN_Pos                                    (2U)
#define RCM_APB1CLKEN_TMR4EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR4EN_Pos)                            /*!< 0x00000004 */
#define RCM_APB1CLKEN_TMR4EN                                        RCM_APB1CLKEN_TMR4EN_Msk                                       /*!< Timer 4 clock enable */
#define RCM_APB1CLKEN_TMR5EN_Pos                                    (3U)
#define RCM_APB1CLKEN_TMR5EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR5EN_Pos)                            /*!< 0x00000008 */
#define RCM_APB1CLKEN_TMR5EN                                        RCM_APB1CLKEN_TMR5EN_Msk                                       /*!< Timer 5 clock enable */
#define RCM_APB1CLKEN_WWDTEN_Pos                                    (11U)
#define RCM_APB1CLKEN_WWDTEN_Msk                                    (0x1UL << RCM_APB1CLKEN_WWDTEN_Pos)                            /*!< 0x00000800 */
#define RCM_APB1CLKEN_WWDTEN                                        RCM_APB1CLKEN_WWDTEN_Msk                                       /*!< Window Watchdog clock enable */
#define RCM_APB1CLKEN_SPI2EN_Pos                                    (14U)
#define RCM_APB1CLKEN_SPI2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_SPI2EN_Pos)                            /*!< 0x00004000 */
#define RCM_APB1CLKEN_SPI2EN                                        RCM_APB1CLKEN_SPI2EN_Msk                                       /*!< SPI 2 clock enable */
#define RCM_APB1CLKEN_USART2EN_Pos                                  (17U)
#define RCM_APB1CLKEN_USART2EN_Msk                                  (0x1UL << RCM_APB1CLKEN_USART2EN_Pos)                          /*!< 0x00020000 */
#define RCM_APB1CLKEN_USART2EN                                      RCM_APB1CLKEN_USART2EN_Msk                                     /*!< USART 2 clock enable */
#define RCM_APB1CLKEN_USART3EN_Pos                                  (18U)
#define RCM_APB1CLKEN_USART3EN_Msk                                  (0x1UL << RCM_APB1CLKEN_USART3EN_Pos)                          /*!< 0x00040000 */
#define RCM_APB1CLKEN_USART3EN                                      RCM_APB1CLKEN_USART3EN_Msk                                     /*!< USART 3 clock enable */
#define RCM_APB1CLKEN_UART4EN_Pos                                   (19U)
#define RCM_APB1CLKEN_UART4EN_Msk                                   (0x1UL << RCM_APB1CLKEN_UART4EN_Pos)                           /*!< 0x00080000 */
#define RCM_APB1CLKEN_UART4EN                                       RCM_APB1CLKEN_UART4EN_Msk                                      /*!< UART 4 clock enable */
#define RCM_APB1CLKEN_I2C1EN_Pos                                    (21U)
#define RCM_APB1CLKEN_I2C1EN_Msk                                    (0x1UL << RCM_APB1CLKEN_I2C1EN_Pos)                            /*!< 0x00200000 */
#define RCM_APB1CLKEN_I2C1EN                                        RCM_APB1CLKEN_I2C1EN_Msk                                       /*!< I2C 1 clock enable */
#define RCM_APB1CLKEN_CAN1EN_Pos                                    (25U)
#define RCM_APB1CLKEN_CAN1EN_Msk                                    (0x1UL << RCM_APB1CLKEN_CAN1EN_Pos)                            /*!< 0x02000000 */
#define RCM_APB1CLKEN_CAN1EN                                        RCM_APB1CLKEN_CAN1EN_Msk                                       /*!< CAN1 clock enable */
#define RCM_APB1CLKEN_CAN2EN_Pos                                    (26U)
#define RCM_APB1CLKEN_CAN2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_CAN2EN_Pos)                            /*!< 0x04000000 */
#define RCM_APB1CLKEN_CAN2EN                                        RCM_APB1CLKEN_CAN2EN_Msk                                       /*!< CAN2 clock enable */
#define RCM_APB1CLKEN_BAKPEN_Pos                                    (27U)
#define RCM_APB1CLKEN_BAKPEN_Msk                                    (0x1UL << RCM_APB1CLKEN_BAKPEN_Pos)                            /*!< 0x08000000 */
#define RCM_APB1CLKEN_BAKPEN                                        RCM_APB1CLKEN_BAKPEN_Msk                                       /*!< Backup interface clock enable */
#define RCM_APB1CLKEN_PMUEN_Pos                                     (28U)
#define RCM_APB1CLKEN_PMUEN_Msk                                     (0x1UL << RCM_APB1CLKEN_PMUEN_Pos)                             /*!< 0x10000000 */
#define RCM_APB1CLKEN_PMUEN                                         RCM_APB1CLKEN_PMUEN_Msk                                        /*!< Power interface clock enable */

/********************  Bit definition for RCM_BDCTRL register  ******************/
#define RCM_BDCTRL_LSEEN_Pos                                        (0U)
#define RCM_BDCTRL_LSEEN_Msk                                        (0x1UL << RCM_BDCTRL_LSEEN_Pos)                                /*!< 0x00000001 */
#define RCM_BDCTRL_LSEEN                                            RCM_BDCTRL_LSEEN_Msk
#define RCM_BDCTRL_LSERDYFLG_Pos                                    (1U)
#define RCM_BDCTRL_LSERDYFLG_Msk                                    (0x1UL << RCM_BDCTRL_LSERDYFLG_Pos)                            /*!< 0x00000002 */
#define RCM_BDCTRL_LSERDYFLG                                        RCM_BDCTRL_LSERDYFLG_Msk
#define RCM_BDCTRL_LSEBCFG_Pos                                      (2U)
#define RCM_BDCTRL_LSEBCFG_Msk                                      (0x1UL << RCM_BDCTRL_LSEBCFG_Pos)                              /*!< 0x00000004 */
#define RCM_BDCTRL_LSEBCFG                                          RCM_BDCTRL_LSEBCFG_Msk

#define RCM_BDCTRL_RTCSRCSEL_Pos                                    (8U)
#define RCM_BDCTRL_RTCSRCSEL_Msk                                    (0x3UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000300 */
#define RCM_BDCTRL_RTCSRCSEL                                        RCM_BDCTRL_RTCSRCSEL_Msk
#define RCM_BDCTRL_RTCSRCSEL_0                                      (0x1UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000100 */
#define RCM_BDCTRL_RTCSRCSEL_1                                      (0x2UL << RCM_BDCTRL_RTCSRCSEL_Pos)                            /*!< 0x00000200 */

