xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*******************  Bit definition for TMR_SMCTRL register  *******************/
#define TMR_SMCTRL_SMFSEL_Pos                                       (0U)
#define TMR_SMCTRL_SMFSEL_Msk                                       (0x7UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x00000007 */
#define TMR_SMCTRL_SMFSEL                                           TMR_SMCTRL_SMFSEL_Msk                                          /*!<SMS[2:0] bits (Slave mode selection)    */
#define TMR_SMCTRL_SMFSEL_0                                         (0x1UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0001 */
#define TMR_SMCTRL_SMFSEL_1                                         (0x2UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0002 */
#define TMR_SMCTRL_SMFSEL_2                                         (0x4UL << TMR_SMCTRL_SMFSEL_Pos)                               /*!< 0x0004 */

#define TMR_SMCTRL_TRGSEL_Pos                                       (4U)
#define TMR_SMCTRL_TRGSEL_Msk                                       (0x7UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x00000070 */
#define TMR_SMCTRL_TRGSEL                                           TMR_SMCTRL_TRGSEL_Msk                                          /*!<TS[2:0] bits (Trigger selection)        */
#define TMR_SMCTRL_TRGSEL_0                                         (0x1UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0010 */
#define TMR_SMCTRL_TRGSEL_1                                         (0x2UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0020 */
#define TMR_SMCTRL_TRGSEL_2                                         (0x4UL << TMR_SMCTRL_TRGSEL_Pos)                               /*!< 0x0040 */

#define TMR_SMCTRL_MSMEN_Pos                                        (7U)
#define TMR_SMCTRL_MSMEN_Msk                                        (0x1UL << TMR_SMCTRL_MSMEN_Pos)                                /*!< 0x00000080 */
#define TMR_SMCTRL_MSMEN                                            TMR_SMCTRL_MSMEN_Msk                                           /*!<Master/slave mode                       */

#define TMR_SMCTRL_ETFCFG_Pos                                       (8U)
#define TMR_SMCTRL_ETFCFG_Msk                                       (0xFUL << TMR_SMCTRL_ETFCFG_Pos)                               /*!< 0x00000F00 */
#define TMR_SMCTRL_ETFCFG                                           TMR_SMCTRL_ETFCFG_Msk                                          /*!<ETF[3:0] bits (External trigger filter) */
#define TMR_SMCTRL_ETFCFG_0                                         (0x1UL << TMR_SMCTRL_ETFCFG_Pos)                               /*!< 0x0100 */
#define TMR_SMCTRL_ETFCFG_1                                         (0x2UL << TMR_SMCTRL_ETFCFG_Pos)                               /*!< 0x0200 */
#define TMR_SMCTRL_ETFCFG_2                                         (0x4UL << TMR_SMCTRL_ETFCFG_Pos)                               /*!< 0x0400 */
#define TMR_SMCTRL_ETFCFG_3                                         (0x8UL << TMR_SMCTRL_ETFCFG_Pos)                               /*!< 0x0800 */

#define TMR_SMCTRL_ETPCFG_Pos                                       (12U)
#define TMR_SMCTRL_ETPCFG_Msk                                       (0x3UL << TMR_SMCTRL_ETPCFG_Pos)                               /*!< 0x00003000 */
#define TMR_SMCTRL_ETPCFG                                           TMR_SMCTRL_ETPCFG_Msk                                          /*!<ETPS[1:0] bits (External trigger prescaler) */
#define TMR_SMCTRL_ETPCFG_0                                         (0x1UL << TMR_SMCTRL_ETPCFG_Pos)                               /*!< 0x1000 */
#define TMR_SMCTRL_ETPCFG_1                                         (0x2UL << TMR_SMCTRL_ETPCFG_Pos)                               /*!< 0x2000 */

#define TMR_SMCTRL_ECEN_Pos                                         (14U)
#define TMR_SMCTRL_ECEN_Msk                                         (0x1UL << TMR_SMCTRL_ECEN_Pos)                                 /*!< 0x00004000 */
#define TMR_SMCTRL_ECEN                                             TMR_SMCTRL_ECEN_Msk                                            /*!<External clock enable     */
#define TMR_SMCTRL_ETPOL_Pos                                        (15U)
#define TMR_SMCTRL_ETPOL_Msk                                        (0x1UL << TMR_SMCTRL_ETPOL_Pos)                                /*!< 0x00008000 */
#define TMR_SMCTRL_ETPOL                                            TMR_SMCTRL_ETPOL_Msk                                           /*!<External trigger polarity */

/*******************  Bit definition for TMR_DIEN register  *******************/
#define TMR_DIEN_UIEN_Pos                                           (0U)
#define TMR_DIEN_UIEN_Msk                                           (0x1UL << TMR_DIEN_UIEN_Pos)                                   /*!< 0x00000001 */
#define TMR_DIEN_UIEN                                               TMR_DIEN_UIEN_Msk                                              /*!<Update interrupt enable */
#define TMR_DIEN_CC1IEN_Pos                                         (1U)
#define TMR_DIEN_CC1IEN_Msk                                         (0x1UL << TMR_DIEN_CC1IEN_Pos)                                 /*!< 0x00000002 */
#define TMR_DIEN_CC1IEN                                             TMR_DIEN_CC1IEN_Msk                                            /*!<Capture/Compare 1 interrupt enable   */
#define TMR_DIEN_CC2IEN_Pos                                         (2U)
#define TMR_DIEN_CC2IEN_Msk                                         (0x1UL << TMR_DIEN_CC2IEN_Pos)                                 /*!< 0x00000004 */
#define TMR_DIEN_CC2IEN                                             TMR_DIEN_CC2IEN_Msk                                            /*!<Capture/Compare 2 interrupt enable   */
#define TMR_DIEN_CC3IEN_Pos                                         (3U)
#define TMR_DIEN_CC3IEN_Msk                                         (0x1UL << TMR_DIEN_CC3IEN_Pos)                                 /*!< 0x00000008 */
#define TMR_DIEN_CC3IEN                                             TMR_DIEN_CC3IEN_Msk                                            /*!<Capture/Compare 3 interrupt enable   */
#define TMR_DIEN_CC4IEN_Pos                                         (4U)
#define TMR_DIEN_CC4IEN_Msk                                         (0x1UL << TMR_DIEN_CC4IEN_Pos)                                 /*!< 0x00000010 */
#define TMR_DIEN_CC4IEN                                             TMR_DIEN_CC4IEN_Msk                                            /*!<Capture/Compare 4 interrupt enable   */
#define TMR_DIEN_COMIEN_Pos                                         (5U)
#define TMR_DIEN_COMIEN_Msk                                         (0x1UL << TMR_DIEN_COMIEN_Pos)                                 /*!< 0x00000020 */
#define TMR_DIEN_COMIEN                                             TMR_DIEN_COMIEN_Msk                                            /*!<COM interrupt enable                 */
#define TMR_DIEN_TRGIEN_Pos                                         (6U)
#define TMR_DIEN_TRGIEN_Msk                                         (0x1UL << TMR_DIEN_TRGIEN_Pos)                                 /*!< 0x00000040 */
#define TMR_DIEN_TRGIEN                                             TMR_DIEN_TRGIEN_Msk                                            /*!<Trigger interrupt enable             */
#define TMR_DIEN_BRKIEN_Pos                                         (7U)
#define TMR_DIEN_BRKIEN_Msk                                         (0x1UL << TMR_DIEN_BRKIEN_Pos)                                 /*!< 0x00000080 */
#define TMR_DIEN_BRKIEN                                             TMR_DIEN_BRKIEN_Msk                                            /*!<Break interrupt enable               */
#define TMR_DIEN_UDIEN_Pos                                          (8U)
#define TMR_DIEN_UDIEN_Msk                                          (0x1UL << TMR_DIEN_UDIEN_Pos)                                  /*!< 0x00000100 */
#define TMR_DIEN_UDIEN                                              TMR_DIEN_UDIEN_Msk                                             /*!<Update DMA request enable            */
#define TMR_DIEN_CC1DEN_Pos                                         (9U)
#define TMR_DIEN_CC1DEN_Msk                                         (0x1UL << TMR_DIEN_CC1DEN_Pos)                                 /*!< 0x00000200 */
#define TMR_DIEN_CC1DEN                                             TMR_DIEN_CC1DEN_Msk                                            /*!<Capture/Compare 1 DMA request enable */
#define TMR_DIEN_CC2DEN_Pos                                         (10U)
#define TMR_DIEN_CC2DEN_Msk                                         (0x1UL << TMR_DIEN_CC2DEN_Pos)                                 /*!< 0x00000400 */
#define TMR_DIEN_CC2DEN                                             TMR_DIEN_CC2DEN_Msk                                            /*!<Capture/Compare 2 DMA request enable */
#define TMR_DIEN_CC3DEN_Pos                                         (11U)
#define TMR_DIEN_CC3DEN_Msk                                         (0x1UL << TMR_DIEN_CC3DEN_Pos)                                 /*!< 0x00000800 */
#define TMR_DIEN_CC3DEN                                             TMR_DIEN_CC3DEN_Msk                                            /*!<Capture/Compare 3 DMA request enable */
#define TMR_DIEN_CC4DEN_Pos                                         (12U)
#define TMR_DIEN_CC4DEN_Msk                                         (0x1UL << TMR_DIEN_CC4DEN_Pos)                                 /*!< 0x00001000 */
#define TMR_DIEN_CC4DEN                                             TMR_DIEN_CC4DEN_Msk                                            /*!<Capture/Compare 4 DMA request enable */
#define TMR_DIEN_COMDEN_Pos                                         (13U)
#define TMR_DIEN_COMDEN_Msk                                         (0x1UL << TMR_DIEN_COMDEN_Pos)                                 /*!< 0x00002000 */
#define TMR_DIEN_COMDEN                                             TMR_DIEN_COMDEN_Msk                                            /*!<COM DMA request enable               */
#define TMR_DIEN_TRGDEN_Pos                                         (14U)
#define TMR_DIEN_TRGDEN_Msk                                         (0x1UL << TMR_DIEN_TRGDEN_Pos)                                 /*!< 0x00004000 */
#define TMR_DIEN_TRGDEN                                             TMR_DIEN_TRGDEN_Msk                                            /*!<Trigger DMA request enable           */

/********************  Bit definition for TMR_STS register  ********************/
#define TMR_STS_UIFLG_Pos                                           (0U)
#define TMR_STS_UIFLG_Msk                                           (0x1UL << TMR_STS_UIFLG_Pos)                                   /*!< 0x00000001 */
#define TMR_STS_UIFLG                                               TMR_STS_UIFLG_Msk                                              /*!<Update interrupt Flag              */
#define TMR_STS_CC1IFLG_Pos                                         (1U)
#define TMR_STS_CC1IFLG_Msk                                         (0x1UL << TMR_STS_CC1IFLG_Pos)                                 /*!< 0x00000002 */
#define TMR_STS_CC1IFLG                                             TMR_STS_CC1IFLG_Msk                                            /*!<Capture/Compare 1 interrupt Flag   */
#define TMR_STS_CC2IFLG_Pos                                         (2U)
#define TMR_STS_CC2IFLG_Msk                                         (0x1UL << TMR_STS_CC2IFLG_Pos)                                 /*!< 0x00000004 */
#define TMR_STS_CC2IFLG                                             TMR_STS_CC2IFLG_Msk                                            /*!<Capture/Compare 2 interrupt Flag   */
#define TMR_STS_CC3IFLG_Pos                                         (3U)
#define TMR_STS_CC3IFLG_Msk                                         (0x1UL << TMR_STS_CC3IFLG_Pos)                                 /*!< 0x00000008 */
#define TMR_STS_CC3IFLG                                             TMR_STS_CC3IFLG_Msk                                            /*!<Capture/Compare 3 interrupt Flag   */
#define TMR_STS_CC4IFLG_Pos                                         (4U)
#define TMR_STS_CC4IFLG_Msk                                         (0x1UL << TMR_STS_CC4IFLG_Pos)                                 /*!< 0x00000010 */
#define TMR_STS_CC4IFLG                                             TMR_STS_CC4IFLG_Msk                                            /*!<Capture/Compare 4 interrupt Flag   */
#define TMR_STS_COMIFLG_Pos                                         (5U)
#define TMR_STS_COMIFLG_Msk                                         (0x1UL << TMR_STS_COMIFLG_Pos)                                 /*!< 0x00000020 */
#define TMR_STS_COMIFLG                                             TMR_STS_COMIFLG_Msk                                            /*!<COM interrupt Flag                 */
#define TMR_STS_TRGIFLG_Pos                                         (6U)
#define TMR_STS_TRGIFLG_Msk                                         (0x1UL << TMR_STS_TRGIFLG_Pos)                                 /*!< 0x00000040 */
#define TMR_STS_TRGIFLG                                             TMR_STS_TRGIFLG_Msk                                            /*!<Trigger interrupt Flag             */
#define TMR_STS_BRKIFLG_Pos                                         (7U)
#define TMR_STS_BRKIFLG_Msk                                         (0x1UL << TMR_STS_BRKIFLG_Pos)                                 /*!< 0x00000080 */
#define TMR_STS_BRKIFLG                                             TMR_STS_BRKIFLG_Msk                                            /*!<Break interrupt Flag               */
#define TMR_STS_CC1RCFLG_Pos                                        (9U)
#define TMR_STS_CC1RCFLG_Msk                                        (0x1UL << TMR_STS_CC1RCFLG_Pos)                                /*!< 0x00000200 */
#define TMR_STS_CC1RCFLG                                            TMR_STS_CC1RCFLG_Msk                                           /*!<Capture/Compare 1 Overcapture Flag */
#define TMR_STS_CC2RCFLG_Pos                                        (10U)
#define TMR_STS_CC2RCFLG_Msk                                        (0x1UL << TMR_STS_CC2RCFLG_Pos)                                /*!< 0x00000400 */
#define TMR_STS_CC2RCFLG                                            TMR_STS_CC2RCFLG_Msk                                           /*!<Capture/Compare 2 Overcapture Flag */
#define TMR_STS_CC3RCFLG_Pos                                        (11U)
#define TMR_STS_CC3RCFLG_Msk                                        (0x1UL << TMR_STS_CC3RCFLG_Pos)                                /*!< 0x00000800 */
#define TMR_STS_CC3RCFLG                                            TMR_STS_CC3RCFLG_Msk                                           /*!<Capture/Compare 3 Overcapture Flag */
#define TMR_STS_CC4RCFLG_Pos                                        (12U)
#define TMR_STS_CC4RCFLG_Msk                                        (0x1UL << TMR_STS_CC4RCFLG_Pos)                                /*!< 0x00001000 */
#define TMR_STS_CC4RCFLG                                            TMR_STS_CC4RCFLG_Msk                                           /*!<Capture/Compare 4 Overcapture Flag */

