xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/******************  Bit definition for USART_CTRL2 register  *******************/
#define USART_CTRL2_ADDR_Pos                                        (0U)
#define USART_CTRL2_ADDR_Msk                                        (0xFUL << USART_CTRL2_ADDR_Pos)                                /*!< 0x0000000F */
#define USART_CTRL2_ADDR                                            USART_CTRL2_ADDR_Msk                                           /*!<Address of the USART node            */
#define USART_CTRL2_LBDLCFG_Pos                                     (5U)
#define USART_CTRL2_LBDLCFG_Msk                                     (0x1UL << USART_CTRL2_LBDLCFG_Pos)                             /*!< 0x00000020 */
#define USART_CTRL2_LBDLCFG                                         USART_CTRL2_LBDLCFG_Msk                                        /*!<LIN Break Detection Length           */
#define USART_CTRL2_LBDIEN_Pos                                      (6U)
#define USART_CTRL2_LBDIEN_Msk                                      (0x1UL << USART_CTRL2_LBDIEN_Pos)                              /*!< 0x00000040 */
#define USART_CTRL2_LBDIEN                                          USART_CTRL2_LBDIEN_Msk                                         /*!<LIN Break Detection Interrupt Enable */
#define USART_CTRL2_LBCPOEN_Pos                                     (8U)
#define USART_CTRL2_LBCPOEN_Msk                                     (0x1UL << USART_CTRL2_LBCPOEN_Pos)                             /*!< 0x00000100 */
#define USART_CTRL2_LBCPOEN                                         USART_CTRL2_LBCPOEN_Msk                                        /*!<Last Bit Clock pulse                 */
#define USART_CTRL2_CPHA_Pos                                        (9U)
#define USART_CTRL2_CPHA_Msk                                        (0x1UL << USART_CTRL2_CPHA_Pos)                                /*!< 0x00000200 */
#define USART_CTRL2_CPHA                                            USART_CTRL2_CPHA_Msk                                           /*!<Clock Phase                          */
#define USART_CTRL2_CPOL_Pos                                        (10U)
#define USART_CTRL2_CPOL_Msk                                        (0x1UL << USART_CTRL2_CPOL_Pos)                                /*!< 0x00000400 */
#define USART_CTRL2_CPOL                                            USART_CTRL2_CPOL_Msk                                           /*!<Clock Polarity                       */
#define USART_CTRL2_CLKEN_Pos                                       (11U)
#define USART_CTRL2_CLKEN_Msk                                       (0x1UL << USART_CTRL2_CLKEN_Pos)                               /*!< 0x00000800 */
#define USART_CTRL2_CLKEN                                           USART_CTRL2_CLKEN_Msk                                          /*!<Clock Enable                         */

#define USART_CTRL2_STOPCFG_Pos                                     (12U)
#define USART_CTRL2_STOPCFG_Msk                                     (0x3UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x00003000 */
#define USART_CTRL2_STOPCFG                                         USART_CTRL2_STOPCFG_Msk                                        /*!<STOP[1:0] bits (STOP bits) */
#define USART_CTRL2_STOPCFG_0                                       (0x1UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x1000 */
#define USART_CTRL2_STOPCFG_1                                       (0x2UL << USART_CTRL2_STOPCFG_Pos)                             /*!< 0x2000 */

#define USART_CTRL2_LINMEN_Pos                                      (14U)
#define USART_CTRL2_LINMEN_Msk                                      (0x1UL << USART_CTRL2_LINMEN_Pos)                              /*!< 0x00004000 */
#define USART_CTRL2_LINMEN                                          USART_CTRL2_LINMEN_Msk                                         /*!<LIN mode enable */

/******************  Bit definition for USART_CTRL3 register  *******************/
#define USART_CTRL3_ERRIEN_Pos                                      (0U)
#define USART_CTRL3_ERRIEN_Msk                                      (0x1UL << USART_CTRL3_ERRIEN_Pos)                              /*!< 0x00000001 */
#define USART_CTRL3_ERRIEN                                          USART_CTRL3_ERRIEN_Msk                                         /*!<Error Interrupt Enable      */
#define USART_CTRL3_IREN_Pos                                        (1U)
#define USART_CTRL3_IREN_Msk                                        (0x1UL << USART_CTRL3_IREN_Pos)                                /*!< 0x00000002 */
#define USART_CTRL3_IREN                                            USART_CTRL3_IREN_Msk                                           /*!<IrDA mode Enable            */
#define USART_CTRL3_IRLPEN_Pos                                      (2U)
#define USART_CTRL3_IRLPEN_Msk                                      (0x1UL << USART_CTRL3_IRLPEN_Pos)                              /*!< 0x00000004 */
#define USART_CTRL3_IRLPEN                                          USART_CTRL3_IRLPEN_Msk                                         /*!<IrDA Low-Power              */
#define USART_CTRL3_HDEN_Pos                                        (3U)
#define USART_CTRL3_HDEN_Msk                                        (0x1UL << USART_CTRL3_HDEN_Pos)                                /*!< 0x00000008 */
#define USART_CTRL3_HDEN                                            USART_CTRL3_HDEN_Msk                                           /*!<Half-Duplex Selection       */
#define USART_CTRL3_SCNACKEN_Pos                                    (4U)
#define USART_CTRL3_SCNACKEN_Msk                                    (0x1UL << USART_CTRL3_SCNACKEN_Pos)                            /*!< 0x00000010 */
#define USART_CTRL3_SCNACKEN                                        USART_CTRL3_SCNACKEN_Msk                                       /*!<Smartcard NACK enable       */
#define USART_CTRL3_SCEN_Pos                                        (5U)
#define USART_CTRL3_SCEN_Msk                                        (0x1UL << USART_CTRL3_SCEN_Pos)                                /*!< 0x00000020 */
#define USART_CTRL3_SCEN                                            USART_CTRL3_SCEN_Msk                                           /*!<Smartcard mode enable       */
#define USART_CTRL3_DMARXEN_Pos                                     (6U)
#define USART_CTRL3_DMARXEN_Msk                                     (0x1UL << USART_CTRL3_DMARXEN_Pos)                             /*!< 0x00000040 */
#define USART_CTRL3_DMARXEN                                         USART_CTRL3_DMARXEN_Msk                                        /*!<DMA Enable Receiver         */
#define USART_CTRL3_DMATXEN_Pos                                     (7U)
#define USART_CTRL3_DMATXEN_Msk                                     (0x1UL << USART_CTRL3_DMATXEN_Pos)                             /*!< 0x00000080 */
#define USART_CTRL3_DMATXEN                                         USART_CTRL3_DMATXEN_Msk                                        /*!<DMA Enable Transmitter      */
#define USART_CTRL3_RTSEN_Pos                                       (8U)
#define USART_CTRL3_RTSEN_Msk                                       (0x1UL << USART_CTRL3_RTSEN_Pos)                               /*!< 0x00000100 */
#define USART_CTRL3_RTSEN                                           USART_CTRL3_RTSEN_Msk                                          /*!<RTS Enable                  */
#define USART_CTRL3_CTSEN_Pos                                       (9U)
#define USART_CTRL3_CTSEN_Msk                                       (0x1UL << USART_CTRL3_CTSEN_Pos)                               /*!< 0x00000200 */
#define USART_CTRL3_CTSEN                                           USART_CTRL3_CTSEN_Msk                                          /*!<CTS Enable                  */
#define USART_CTRL3_CTSIEN_Pos                                      (10U)
#define USART_CTRL3_CTSIEN_Msk                                      (0x1UL << USART_CTRL3_CTSIEN_Pos)                              /*!< 0x00000400 */
#define USART_CTRL3_CTSIEN                                          USART_CTRL3_CTSIEN_Msk                                         /*!<CTS Interrupt Enable        */

