xltzsoft/shucai/likongjiazhua-0210-4channel-主机55aa读数据，55ab校准/Libraries/Device/Geehy/APM32F4xx/Include/apm32f403xx.h
/*
 * @brief Specific devices reset values definitions
 */

#define RCM_MAX_FREQUENCY           120000000U          /*!< Max frequency of family in Hz*/
#define RCM_PLLVCO_OUTPUT_MIN       100000000U          /*!< Frequency min for PLLVCO output, in Hz */
#define RCM_PLLVCO_INPUT_MIN          4000000U          /*!< Frequency min for PLLVCO input, in Hz  */
#define RCM_PLLVCO_INPUT_MAX          1600000U          /*!< Frequency max for PLLVCO input, in Hz  */
#define RCM_PLLVCO_OUTPUT_MAX       RCM_MAX_FREQUENCY   /*!< Frequency max for PLLVCO output, in Hz */

#define FLASH_LATENCY1_FREQ         30000000U           /*!< HCLK frequency to set FLASH latency 1 */
#define FLASH_LATENCY2_FREQ         60000000U           /*!< HCLK frequency to set FLASH latency 2 */
#define FLASH_LATENCY3_FREQ         90000000U           /*!< HCLK frequency to set FLASH latency 3 */

/******************************************************************************/
/*  For a painless codes migration between the APM32F4xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */
/*  product lines within the same APM32F4 Family                              */
/******************************************************************************/

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __APM32F403xx_H */
